{
    "SYS.1":[
            {
                "BP_ID": "SYS.1.BP1",
                "BP_title": "Obtain stakeholder expectations and requests.",
                "BP_statement": "Obtain and define stakeholder expectations and requests through direct solicitation of stakeholder input, and through review of stakeholder business proposals (where relevant) and other documents containing inputs to stakeholder requirements, and consideration of the target operating and hardware environment.",
                "BP_key_obj": "Gather inputs from all relevant sources, Define stakeholder needs and context, Document initial requests and expectations.",
                "BP_user_docs_needed": "Stakeholder Requirements Specification (StRS), Meeting Minutes with Stakeholders, Business Proposals, Market Analysis Documents, Use Case Descriptions, Interview Records.",
                "BP_rating_rules": {
                        "F": [
                            "A systematic process for identifying and engaging all relevant stakeholders is defined and followed.",
                            "Evidence of direct communication (e.g., meeting minutes, interview notes) exists and covers all key areas.",
                            "Stakeholder business proposals and other relevant input documents are systematically reviewed and analyzed.",
                            "The target operating environment is clearly defined and considered.",
                            "The source of every stakeholder requirement is documented."
                        ],
                        "L": [
                            "Most key stakeholders are consulted, and their input is gathered.",
                            "Communication is largely effective, though some records may be informal or slightly incomplete.",
                            "The process for gathering requirements is generally followed, but may have minor deviations.",
                            "The resulting requirements provide a good, but not perfect, understanding of stakeholder needs."
                        ],
                        "P": [
                            "Only the primary stakeholder (e.g., the direct customer) is consulted, while others (e.g., end-users, service technicians) are ignored.",
                            "The gathering of requirements is ad-hoc and reactive.",
                            "Significant gaps exist in the understanding of the context or stakeholder needs.",
                            "The source of requirements is often not documented."
                        ],
                        "N": [
                            "No evidence of stakeholder consultation exists.",
                            "Requirements are assumed or invented by the project team without external input.",
                            "There are no documented stakeholder requirements."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.1.BP2",
                "BP_title": "Agree on requirements.",
                "BP_statement": "Formalize the stakeholders expectations and requests into requirements. Reach a common understanding of the set of stakeholder requirements among affected parties by obtaining an explicit agreement from all affected parties.",
                "BP_key_obj": "Formalize requirements, Achieve common understanding, Secure explicit agreement, Establish a baseline.",
                "BP_user_docs_needed": "Stakeholder Requirements Specification (StRS) with status, Review Records, Approval Records or Sign-offs, Feasibility Study Results, Cost/Schedule Impact Analysis.",
                "BP_rating_rules": {
                        "F": [
                            "All stakeholder requirements are formalized and documented in a specification.",
                            "There is documented evidence (e.g., review protocol, sign-off sheet) of explicit agreement from all identified affected parties.",
                            "Feasibility studies and impact analyses have been performed and used as a basis for agreement.",
                            "A clear, agreed-upon baseline of stakeholder requirements is established."
                        ],
                        "L": [
                            "The vast majority of requirements are formalized and agreed upon with the main stakeholders.",
                            "Agreement from some secondary affected parties may be implicit or not formally documented.",
                            "The requirements baseline is mostly stable and understood.",
                            "Minor ambiguities may exist but do not block progress."
                        ],
                        "P": [
                            "Agreement is only obtained from the project sponsor, not other affected parties.",
                            "Requirements are documented, but there is no formal review or agreement process.",
                            "Significant disagreements or misunderstandings about the requirements persist.",
                            "The requirements are not considered a stable baseline."
                        ],
                        "N": [
                            "No attempt is made to gain agreement on the requirements.",
                            "There is no formalized Stakeholder Requirements Specification.",
                            "Work begins based on informal, unverified requests."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.1.BP3",
                "BP_title": "Analyze stakeholder requirements changes.",
                "BP_statement": "Analyze all changes made to the stakeholder requirements against the agreed stakeholder requirements. Assess the impact and risks, and initiate appropriate change control and mitigation actions.",
                "BP_key_obj": "Impact Analysis, Risk Assessment, Change Control, Traceability.",
                "BP_user_docs_needed": "Change Requests, Impact Analysis Report, Risk Assessment Log, Updated Stakeholder Requirements Specification, Change Control Board (CCB) Meeting Minutes.",
                "BP_rating_rules": {
                        "F": [
                            "A defined change management process (see SUP.10) is consistently followed for every change request.",
                            "Every change is analyzed for its impact on cost, schedule, and technical aspects.",
                            "Risks associated with the change are identified, assessed, and mitigation actions are defined.",
                            "The analysis results are documented and communicated to the relevant decision-makers (e.g., CCB).",
                            "The status of all change requests is tracked and known."
                        ],
                        "L": [
                            "Most changes are analyzed, but the analysis for minor changes may be informal.",
                            "Impact and risk assessment is generally performed but might lack depth in some cases.",
                            "A change control process exists and is mostly followed.",
                            "The overall impact of changes is understood and managed."
                        ],
                        "P": [
                            "Changes are accepted without a formal analysis of impact or risk.",
                            "The analysis, if done, is superficial and does not consider all affected areas.",
                            "There is no formal change control process; changes are implemented as they arrive.",
                            "This leads to scope creep and project instability."
                        ],
                        "N": [
                            "Changes to requirements are not tracked.",
                            "The agreed baseline is not maintained.",
                            "There is no concept of change analysis or control."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.1.BP4",
                "BP_title": "Communicate requirements status.",
                "BP_statement": "Ensure all affected parties can be aware of the status and disposition of their requirements including changes and can communicate necessary information and data.",
                "BP_key_obj": "Transparency, Status Tracking, Accessibility, Stakeholder Awareness.",
                "BP_user_docs_needed": "Communication Plan, Requirements Traceability Matrix with Status, Change Request Log, Project Status Reports, Requirements Management Tool Access/Views.",
                "BP_rating_rules": {
                        "F": [
                            "A mechanism (e.g., a requirements management tool, a shared document) is in place and accessible to all affected parties.",
                            "The status of every requirement (e.g., proposed, agreed, implemented, verified) is clearly tracked and up-to-date.",
                            "The disposition of all change requests (accepted, rejected, pending) is communicated to the requesters and other stakeholders.",
                            "Communication of status is proactive and regular."
                        ],
                        "L": [
                            "Key stakeholders are kept informed about the status of their requirements, primarily through status meetings or reports.",
                            "The tracking system is mostly up-to-date, but there may be some lag.",
                            "Not all affected parties may have direct access to the system, but the information is available upon request."
                        ],
                        "P": [
                            "Communication is ad-hoc and only happens when problems arise.",
                            "The status of requirements is not formally tracked or is significantly out of date.",
                            "Stakeholders are often unaware of the status or disposition of their requests.",
                            "Information is difficult to find."
                        ],
                        "N": [
                            "No communication about requirements status occurs.",
                            "There is no system for tracking the status of requirements.",
                            "Stakeholders have no visibility into the requirements process after their initial input."
                        ]
                    }
            }
        ],
    "SYS.2":[
            {
                "BP_ID": "SYS.2.BP1",
                "BP_title": "Specify system requirements.",
                "BP_statement": "Use the stakeholder requirements to identify and document the functional and non-functional requirements for the system according to defined characteristics for requirements.",
                "BP_key_obj": "Elaboration, Translation, Quality, Documentation.",
                "BP_user_docs_needed": "Stakeholder Requirements Specification (StRS), System Requirements Specification (SyRS), Requirements Management Plan (RMP), Review Records.",
                "BP_rating_rules": {
                        "F": [
                            "All relevant stakeholder requirements are clearly covered by one or more system requirements.",
                            "Each system requirement is unambiguous, verifiable, consistent, feasible, and complete.",
                            "Each system requirement is atomic (describes a single piece of functionality).",
                            "All requirements are explicitly and correctly classified (e.g., Functional, Non-Functional, Safety) according to definitions in the RMP."
                        ],
                        "L": [
                            "The vast majority of stakeholder requirements are covered.",
                            "Most system requirements are of high quality, but there may be minor issues in a small number of them (e.g., a few requirements could be worded more clearly).",
                            "Most contradictions or issues were identified and resolved during reviews.",
                            "The overall document is a reliable basis for system design."
                        ],
                        "P": [
                            "There are significant gaps in coverage; numerous stakeholder requirements are not addressed.",
                            "A significant number of system requirements are ambiguous (using words like 'fast', 'easy'), non-verifiable, or inconsistent.",
                            "The classification of requirements is often missing or incorrect.",
                            "The document requires significant rework to be a reliable basis for design."
                        ],
                        "N": [
                            "No System Requirements Specification (SyRS) exists.",
                            "The SyRS is just a copy-paste of the Stakeholder Requirements without any engineering analysis or refinement.",
                            "The SyRS is so poor it provides no value."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.2.BP2",
                "BP_title": "Structure system requirements.",
                "BP_statement": "Structure and prioritize the system requirements.",
                "BP_key_obj": "Organization, Prioritization, Grouping, Clarity.",
                "BP_user_docs_needed": "System Requirements Specification (SyRS) with structure and priorities, Product Release Plan, Requirements Management Tool Configuration.",
                "BP_rating_rules": {
                        "F": [
                            "A clear and logical structure for system requirements is defined and consistently applied.",
                            "Requirements are grouped by relevant criteria (e.g., by feature, by product variant, by domain).",
                            "All requirements have a defined priority based on an agreed-upon scheme (e.g., MoSCoW, numerical).",
                            "Prioritization is linked to project needs and release planning."
                        ],
                        "L": [
                            "Requirements are structured, but the structure may have some minor inconsistencies.",
                            "Most requirements are prioritized, though the rationale for some priorities may not be explicitly documented.",
                            "The document is generally easy to navigate and understand."
                        ],
                        "P": [
                            "Requirements are listed in a flat, unstructured list.",
                            "No prioritization is applied, or it is applied inconsistently.",
                            "It is difficult to find related requirements or understand the scope of a release."
                        ],
                        "N": [
                            "There is no attempt to structure or prioritize requirements."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.2.BP3",
                "BP_title": "Analyze system requirements.",
                "BP_statement": "Analyze the specified system requirements including their interdependencies to ensure correctness, technical feasibility, and to support project management regarding project estimates.",
                "BP_key_obj": "Feasibility Analysis, Interdependency Analysis, Risk Identification, Estimation Support.",
                "BP_user_docs_needed": "System Requirements Analysis Report, Feasibility Study, Technical Risk Log, Project Estimation Data, Review Records.",
                "BP_rating_rules": {
                        "F": [
                            "A systematic analysis of all system requirements is performed and documented.",
                            "Technical feasibility is confirmed for all requirements, potentially using prototypes or simulations.",
                            "Interdependencies between requirements are identified and documented.",
                            "The analysis results are used as a reliable input for project planning and estimation (see MAN.3).",
                            "Potential conflicts and inconsistencies between requirements are identified and resolved."
                        ],
                        "L": [
                            "Analysis is performed for most requirements, especially the high-risk ones.",
                            "Feasibility is assessed, but might be based on expert opinion rather than formal studies for less critical requirements.",
                            "Major interdependencies are identified.",
                            "The analysis provides a reasonable basis for project planning."
                        ],
                        "P": [
                            "Analysis is superficial or only performed for a few requirements.",
                            "Technical feasibility is assumed, not verified.",
                            "Significant conflicts between requirements remain undiscovered.",
                            "Project estimates are made without a solid analytical basis from the requirements."
                        ],
                        "N": [
                            "No analysis of system requirements is performed.",
                            "The team proceeds to design without knowing if the requirements are feasible or consistent."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.2.BP4",
                "BP_title": "Analyze the impact on the system context.",
                "BP_statement": "Analyze the impact that the system requirements will have on elements in the relevant system context.",
                "BP_key_obj": "System Interface Analysis, Operational Impact, Environmental Impact, Lifecycle Impact.",
                "BP_user_docs_needed": "System Context Diagram, Impact Analysis Report, Interface Control Documents (ICDs).",
                "BP_rating_rules": {
                        "F": [
                            "The system context and all external interfaces are clearly defined.",
                            "A systematic analysis is conducted to determine the impact of the system requirements on the operational environment (e.g., manufacturing, service, other systems).",
                            "The results of the impact analysis are documented and used to refine requirements or interface specifications.",
                            "All affected external parties are consulted regarding the impact."
                        ],
                        "L": [
                            "The impact on the primary external interfaces and operational environment is analyzed.",
                            "Some secondary impacts (e.g., on decommissioning) may be overlooked.",
                            "The analysis is sufficient to avoid major integration problems."
                        ],
                        "P": [
                            "Impact analysis is minimal or focuses only on one aspect (e.g., a single electrical interface).",
                            "The system is designed with little consideration for its operating environment or other systems it must interact with.",
                            "This leads to integration issues and operational problems late in the project."
                        ],
                        "N": [
                            "No analysis of the impact on the system context is performed."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.2.BP5",
                "BP_title": "Ensure consistency and establish bidirectional traceability.",
                "BP_statement": "Ensure consistency and establish bidirectional traceability between system requirements and stakeholder requirements.",
                "BP_key_obj": "Traceability, Consistency, Coverage Analysis, Impact Analysis Enablement.",
                "BP_user_docs_needed": "Requirements Traceability Matrix, Consistency Analysis Report, Requirements Management Tool Data, Review Records.",
                "BP_rating_rules": {
                        "F": [
                            "Bidirectional traceability is established between every system requirement and its source stakeholder requirement(s).",
                            "Traceability links are regularly reviewed and maintained.",
                            "A consistency check is performed to ensure that linked requirements are not in conflict.",
                            "Coverage analysis is performed to ensure all stakeholder requirements are addressed by system requirements.",
                            "The traceability is complete and correct."
                        ],
                        "L": [
                            "Traceability is established for the vast majority of requirements.",
                            "There may be a few missing or incorrect links, but they are minor and easily fixed.",
                            "Consistency is checked, and major inconsistencies are resolved.",
                            "Coverage is largely complete."
                        ],
                        "P": [
                            "Traceability is sporadic, with many missing links.",
                            "Links exist, but their correctness is not verified (i.e., 'linked' does not mean 'consistent').",
                            "Significant gaps in coverage exist, which are not visible due to poor traceability.",
                            "Impact analysis of changes is difficult or impossible."
                        ],
                        "N": [
                            "No traceability is established between stakeholder and system requirements."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.2.BP6",
                "BP_title": "Communicate agreed system requirements and impact on the system context.",
                "BP_statement": "Communicate the agreed system requirements, and results of the impact analysis on the system context, to all affected parties.",
                "BP_key_obj": "Alignment, Information Sharing, Establishing a Baseline, Stakeholder Notification.",
                "BP_user_docs_needed": "Communication Plan, System Requirements Specification (baselined), Impact Analysis Report, Meeting Minutes, Release Notes.",
                "BP_rating_rules": {
                        "F": [
                            "A formal communication of the baselined system requirements is made to all affected parties (e.g., design teams, test teams, management).",
                            "The communication includes the results of the system context impact analysis.",
                            "A mechanism is in place to ensure all parties are working from the correct version of the requirements.",
                            "Evidence of communication (e.g., email, meeting record) is kept."
                        ],
                        "L": [
                            "The agreed system requirements are communicated to the key teams.",
                            "Communication might be less formal, but is effective.",
                            "Most affected parties are aware of the requirements baseline."
                        ],
                        "P": [
                            "Communication is inconsistent; some teams receive the requirements while others do not.",
                            "Different teams may be working from different versions of the requirements.",
                            "The impact analysis results are not communicated."
                        ],
                        "N": [
                            "The agreed system requirements are not communicated to anyone outside the requirements team.",
                            "There is no established baseline for other teams to work from."
                        ]
                    }
            }
        ],
    "SYS.3":[
            {
                "BP_ID": "SYS.3.BP1",
                "BP_title": "Specify static aspects of the system architecture.",
                "BP_statement": "Specify and document the static aspects of the system architecture with respect to the functional and non-functional system requirements, including external interfaces and a defined set of system elements with their interfaces and relationships.",
                "BP_key_obj": "Decomposition, Interface Definition, Element Identification, Structural Design.",
                "BP_user_docs_needed": "System Architecture Design Document, System Requirements Specification, Block Diagrams, Interface Control Documents (ICDs).",
                "BP_rating_rules": {
                        "F": [
                            "The architecture document clearly defines all system elements.",
                            "All external and internal interfaces are specified, including their properties (e.g., protocols, data types, ranges).",
                            "The relationships and dependencies between system elements are clearly documented.",
                            "The static design logically and completely addresses the system requirements."
                        ],
                        "L": [
                            "The main system elements and their key interfaces are defined.",
                            "Some details in the interface specifications might be missing but can be inferred.",
                            "The static architecture is mostly complete and provides a solid foundation for design.",
                            "Minor ambiguities exist but do not prevent implementation."
                        ],
                        "P": [
                            "System elements are identified, but their interfaces are poorly defined or missing.",
                            "Significant gaps exist in the definition of the system's structure.",
                            "The documentation is a collection of informal diagrams with little detail.",
                            "The design does not clearly map to the requirements."
                        ],
                        "N": [
                            "No system architecture document exists.",
                            "There is no definition of system elements or interfaces."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.3.BP2",
                "BP_title": "Specify dynamic aspects of the system architecture.",
                "BP_statement": "Specify and document the dynamic aspects of the system architecture with respect to the functional and non-functional system requirements including the behavior of the system elements and their interaction in different system modes.",
                "BP_key_obj": "Behavioral Modeling, Interaction Analysis, State Modeling, Performance Specification.",
                "BP_user_docs_needed": "System Architecture Design Document, Sequence Diagrams, State Charts, Timing Diagrams, Mode Management Specification.",
                "BP_rating_rules": {
                        "F": [
                            "The behavior of each system element is specified.",
                            "Interactions between elements (e.g., message sequences, timing) are clearly documented for different scenarios.",
                            "System modes (e.g., startup, normal operation, shutdown, fault) are defined and the behavior in each mode is specified.",
                            "The dynamic model is consistent with the static architecture and fulfills the system requirements."
                        ],
                        "L": [
                            "The dynamic behavior for the main operational scenarios is documented.",
                            "Some edge cases or fault modes may be less detailed.",
                            "The overall behavior of the system is understandable and largely complete.",
                            "The model is a good basis for implementation and integration testing."
                        ],
                        "P": [
                            "Only 'happy path' scenarios are considered; error and startup behaviors are ignored.",
                            "Dynamic models are incomplete or inconsistent with the static architecture.",
                            "Timing and sequence information is missing or vague.",
                            "Significant behavioral questions are left unanswered for the developers."
                        ],
                        "N": [
                            "No dynamic aspects of the architecture are specified.",
                            "The design only describes what the components are, not what they do or how they interact."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.3.BP3",
                "BP_title": "Analyze system architecture.",
                "BP_statement": "Analyze the system architecture regarding relevant technical design aspects related to the product lifecycle, and to support project management regarding project estimates, and derive special characteristics for non-software system elements. Document a rationale for the system architectural design decisions.",
                "BP_key_obj": "Trade-off Analysis, Lifecycle Consideration, Risk Identification, Decision Rationale.",
                "BP_user_docs_needed": "Architecture Analysis Report (e.g., FMEA, simulation results), Trade-off Studies, Design Decision Records, List of Special Characteristics, Project Estimation Data.",
                "BP_rating_rules": {
                        "F": [
                            "The architecture is systematically analyzed against quality attributes (e.g., performance, safety, security, manufacturability).",
                            "Analysis methods like FMEA or simulation are used to evaluate the design.",
                            "Key design decisions are documented with a clear rationale, including alternatives considered.",
                            "Special characteristics (e.g., critical dimensions, safety-critical parameters) are identified.",
                            "The analysis provides a solid basis for project estimates."
                        ],
                        "L": [
                            "The architecture is analyzed for key technical aspects.",
                            "Analysis may be less formal (e.g., expert reviews) but still effective at identifying major issues.",
                            "Major design decisions have a documented rationale.",
                            "The design is considered robust and feasible."
                        ],
                        "P": [
                            "Analysis is superficial or non-existent.",
                            "Design decisions are made without a clear rationale or consideration of alternatives.",
                            "Potential issues with performance, manufacturability, or other qualities are not identified.",
                            "Special characteristics are not identified, leading to potential quality issues."
                        ],
                        "N": [
                            "No analysis of the architecture is performed.",
                            "The first idea is implemented without evaluation."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.3.BP4",
                "BP_title": "Ensure consistency and establish bidirectional traceability.",
                "BP_statement": "Ensure consistency and establish bidirectional traceability between the elements of the system architecture and the system requirements that represent properties or characteristics of the physical end product.",
                "BP_key_obj": "Traceability, Consistency, Coverage Analysis, Allocation.",
                "BP_user_docs_needed": "Architecture-to-Requirements Traceability Matrix, Consistency Analysis Report, Requirements Management Tool Data, Review Records.",
                "BP_rating_rules": {
                        "F": [
                            "Bidirectional traceability is established between system requirements and the architectural elements that implement them.",
                            "A consistency check is performed to ensure the architecture fulfills the linked requirements without contradiction.",
                            "Coverage analysis demonstrates that all relevant system requirements have been allocated to the architecture.",
                            "Traceability is complete, correct, and maintained."
                        ],
                        "L": [
                            "Traceability is established for the vast majority of requirements to the architecture.",
                            "There may be a few missing or incorrect links, but they are minor.",
                            "Consistency is checked for critical areas.",
                            "Coverage is largely complete."
                        ],
                        "P": [
                            "Traceability is sporadic, with many missing links.",
                            "Requirements are not allocated to specific architectural elements.",
                            "It is impossible to tell if the architecture covers all requirements.",
                            "Impact analysis of a requirement change on the architecture is difficult or impossible."
                        ],
                        "N": [
                            "No traceability is established between requirements and architecture."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.3.BP5",
                "BP_title": "Communicate agreed system architecture.",
                "BP_statement": "Communicate the agreed system architecture, including the special characteristics, to all affected parties.",
                "BP_key_obj": "Alignment, Information Distribution, Establishing a Design Baseline, Knowledge Transfer.",
                "BP_user_docs_needed": "Communication Plan, Baselined System Architecture Design Document, List of Special Characteristics, Meeting Minutes, Release Notes.",
                "BP_rating_rules": {
                        "F": [
                            "A formal communication of the baselined system architecture is made to all affected parties (e.g., SW/HW/ME design teams, test teams).",
                            "The communication includes the list of special characteristics and the rationale for key decisions.",
                            "A mechanism is in place to ensure all parties are working from the correct version of the architecture.",
                            "Evidence of communication (e.g., email, review record) is kept."
                        ],
                        "L": [
                            "The agreed architecture is communicated to the key teams.",
                            "Communication might be less formal but is effective in aligning the teams.",
                            "Most affected parties are aware of the architectural baseline."
                        ],
                        "P": [
                            "Communication is inconsistent; some teams receive the architecture while others do not.",
                            "Different teams may be working from different versions or have different understandings of the architecture.",
                            "Special characteristics are not communicated, leading to risks in implementation."
                        ],
                        "N": [
                            "The agreed architecture is not communicated to anyone outside the architecture team.",
                            "There is no established design baseline for implementation teams to work from."
                        ]
                    }
            }
        ],
    "SYS.4":[
            {
                "BP_ID": "SYS.4.BP1",
                "BP_title": "Specify verification measures for system integration.",
                "BP_statement": "Specify the verification measures, based on a defined sequence and preconditions for the integration of system elements against the system static and dynamic aspects of the system architecture, including techniques for the verification measures, pass/fail criteria for verification measures, a definition of entry and exit criteria for the verification measures, and the required verification infrastructure and environment setup.",
                "BP_key_obj": "Test Case Design, Test Environment Specification, Pass/Fail Criteria, Integration Strategy.",
                "BP_user_docs_needed": "System Integration Test Specification, System Architecture Design Document, Integration Strategy Document, Test Environment Specification.",
                "BP_rating_rules": {
                        "F": [
                            "Verification measures (test cases) are specified for verifying interfaces and interactions between system elements as defined in the architecture.",
                            "Each verification measure includes unambiguous pass/fail criteria.",
                            "The required test environment, tools, and infrastructure are specified.",
                            "The integration sequence and preconditions for starting verification are clearly defined.",
                            "The specification is detailed enough for a test engineer to execute it without ambiguity."
                        ],
                        "L": [
                            "Verification measures are specified for the most critical interfaces and interactions.",
                            "Pass/fail criteria are generally clear, but some may require interpretation.",
                            "The test environment is specified, but some minor details might be missing.",
                            "The specification is largely complete and usable."
                        ],
                        "P": [
                            "Verification measures are defined at a high level (e.g., 'Test the CAN interface') without specific steps or criteria.",
                            "Pass/fail criteria are missing or subjective ('should work correctly').",
                            "The required test environment is not specified.",
                            "Significant ambiguity exists, requiring the tester to design the test during execution."
                        ],
                        "N": [
                            "No integration verification measures are specified.",
                            "Integration is performed with ad-hoc, undocumented 'smoke tests'."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.4.BP2",
                "BP_title": "Select verification measures.",
                "BP_statement": "Document the selection of verification measures for each integration step considering selection criteria including criteria for regression verification. The documented selection of verification measures shall have sufficient coverage according to the release scope.",
                "BP_key_obj": "Test Scoping, Regression Strategy, Risk-based Selection, Release Readiness.",
                "BP_user_docs_needed": "System Integration Test Plan, Release Plan, Change Log, Risk Assessment Log, Selected Test Set Document.",
                "BP_rating_rules": {
                        "F": [
                            "A documented strategy for selecting verification measures for each release exists and is followed.",
                            "The selection considers the release scope, changes since the last release, and risk analysis.",
                            "A specific set of verification measures for regression testing is defined and justified.",
                            "The selected set provides demonstrably sufficient coverage for the integration level and release scope."
                        ],
                        "L": [
                            "A selection of verification measures is made for each release.",
                            "The rationale for selection is mostly clear, though not always formally documented.",
                            "Regression testing is performed based on experience and knowledge of changes.",
                            "The selection is reasonable and covers the main changes and risks."
                        ],
                        "P": [
                            "The same set of tests is run for every release, regardless of the changes (inefficient).",
                            "Or, only new features are tested, with no regression testing.",
                            "The selection is ad-hoc, with no clear strategy or documentation.",
                            "Coverage is unknown."
                        ],
                        "N": [
                            "No selection of verification measures is performed; testing is chaotic and unplanned."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.4.BP3",
                "BP_title": "Integrate system elements and perform integration verification.",
                "BP_statement": "Integrate the system elements until the system is fully integrated according to the specified interfaces and interactions between the system elements, and according to the defined sequence and defined preconditions. Perform the selected system integration verification measures. Record the verification measure data including pass/fail status and corresponding verification measure data.",
                "BP_key_obj": "System Assembly, Test Execution, Result Recording, Defect Reporting.",
                "BP_user_docs_needed": "Integration Log, Test Execution Log, Test Results, Defect Reports (see SUP.9), Integrated System.",
                "BP_rating_rules": {
                        "F": [
                            "System elements are integrated following the defined integration sequence.",
                            "The selected verification measures are executed systematically.",
                            "The results of each step (pass/fail status) are recorded accurately.",
                            "All deviations from expected results (failures) are documented in a problem resolution system (see SUP.9).",
                            "The test environment and item versions are recorded for each test run."
                        ],
                        "L": [
                            "Integration and verification are performed.",
                            "Results are recorded, but some details of the execution (e.g., specific software version) may be missing.",
                            "Most failures are reported, but some may be fixed informally.",
                            "The process is largely effective."
                        ],
                        "P": [
                            "Integration is performed without following a sequence.",
                            "Only a subset of the selected tests is executed.",
                            "Test results are not formally recorded (e.g., 'it seemed to work').",
                            "Failures are not systematically reported, leading to recurring problems."
                        ],
                        "N": [
                            "No integration verification is performed, or if it is, no records are kept."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.4.BP4",
                "BP_title": "Ensure consistency and establish bidirectional traceability.",
                "BP_statement": "Ensure consistency and establish bidirectional traceability between verification measures and the system architecture. Establish bidirectional traceability between verification results and verification measures.",
                "BP_key_obj": "Test Coverage Analysis, Traceability, Consistency, Status Reporting.",
                "BP_user_docs_needed": "Architecture-to-Test-Case Traceability Matrix, Test-Case-to-Test-Result Traceability, Consistency Analysis Report, Test Coverage Report.",
                "BP_rating_rules": {
                        "F": [
                            "Bidirectional traceability is established between architectural elements/interfaces and the verification measures that test them.",
                            "Bidirectional traceability is established between every executed verification measure and its corresponding result.",
                            "A consistency check is performed to ensure the verification measures are appropriate for the architectural elements they trace to.",
                            "Coverage analysis demonstrates that all specified interfaces and interactions are tested."
                        ],
                        "L": [
                            "Traceability is established for most verification measures to the architecture.",
                            "Traceability from test results back to the test cases exists.",
                            "There may be minor gaps or inconsistencies in the traceability.",
                            "Coverage is largely complete for critical areas."
                        ],
                        "P": [
                            "Traceability is sporadic or only exists in one direction.",
                            "It is difficult to determine which parts of the architecture have been tested.",
                            "It is difficult to find the result for a specific test case.",
                            "Test coverage is unknown."
                        ],
                        "N": [
                            "No traceability is established."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.4.BP5",
                "BP_title": "Summarize and communicate results.",
                "BP_statement": "Summarize the system integration and integration verification results and communicate them to all affected parties.",
                "BP_key_obj": "Reporting, Communication, Status Transparency, Decision Support.",
                "BP_user_docs_needed": "System Integration Test Summary Report, Communication Evidence (e.g., emails, meeting minutes), Defect Summary Report, Test Coverage Statistics.",
                "BP_rating_rules": {
                        "F": [
                            "A summary report is created after each integration and verification cycle.",
                            "The report includes a summary of executed tests, pass/fail statistics, a list of open defects, and a statement on test coverage.",
                            "The report provides a clear assessment of the integration status and remaining risks.",
                            "The report is communicated to all affected parties to support decision-making (e.g., readiness for system testing)."
                        ],
                        "L": [
                            "Results are summarized and communicated, for example, in project status meetings.",
                            "The summary provides a good overview of the integration status, although it may not be a formal, standalone report.",
                            "Key stakeholders are informed of the progress and major issues."
                        ],
                        "P": [
                            "Only raw test logs or a list of defects are provided, without any summary or analysis.",
                            "Communication is ad-hoc or non-existent.",
                            "Stakeholders are not aware of the current integration status or quality."
                        ],
                        "N": [
                            "No summary or communication of results occurs."
                        ]
                    }
            }
        ],
    "SYS.5":[
            {
                "BP_ID": "SYS.5.BP1",
                "BP_title": "Specify verification measures for system verification.",
                "BP_statement": "Specify the verification measures for system verification suitable to provide evidence for compliance with the functional and non-functional information in the system requirements, including techniques for the verification measures, pass/fail criteria for verification measures, a definition of entry and exit criteria for the verification measures, necessary sequence of verification measures, and the required verification infrastructure and environment setup.",
                "BP_key_obj": "Test Case Design, Requirements-based Testing, Test Environment Specification, Pass/Fail Criteria.",
                "BP_user_docs_needed": "System Test Specification, System Requirements Specification, Test Environment Specification, Test Strategy.",
                "BP_rating_rules": {
                        "F": [
                            "Verification measures (test cases) are specified for verifying each system requirement.",
                            "Each verification measure includes unambiguous pass/fail criteria derived from the requirement.",
                            "The required test environment, tools, and infrastructure are specified to simulate the real-world context.",
                            "Test entry/exit criteria and any necessary sequencing are defined.",
                            "The specification is detailed enough for a test engineer to execute it without ambiguity."
                        ],
                        "L": [
                            "Verification measures are specified for the most critical system requirements.",
                            "Pass/fail criteria are generally clear, but some may require interpretation.",
                            "The test environment is specified, but some minor details might be missing.",
                            "The specification is largely complete and usable for verifying the system."
                        ],
                        "P": [
                            "Verification measures are defined at a high level (e.g., 'Test feature X') without specific steps or criteria derived from requirements.",
                            "Pass/fail criteria are missing or subjective ('system should be user-friendly').",
                            "The required test environment is not specified.",
                            "Significant ambiguity exists, making verification results unreliable."
                        ],
                        "N": [
                            "No system verification measures are specified.",
                            "Testing is based on ad-hoc, undocumented exploration of the system."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.5.BP2",
                "BP_title": "Select verification measures.",
                "BP_statement": "Document the selection of verification measures considering selection criteria including criteria for regression verification. The selection of verification measures shall have sufficient coverage according to the release scope.",
                "BP_key_obj": "Test Scoping, Regression Strategy, Risk-based Selection, Release Readiness.",
                "BP_user_docs_needed": "System Test Plan, Release Plan, Change Log, Risk Assessment Log, Selected Test Set Document.",
                "BP_rating_rules": {
                        "F": [
                            "A documented strategy for selecting verification measures for each release exists and is followed.",
                            "The selection considers requirement priorities, changes since the last release, and risk analysis.",
                            "A specific set of verification measures for regression testing is defined and justified to ensure existing functionality is not broken.",
                            "The selected set provides demonstrably sufficient coverage of the system requirements for the release."
                        ],
                        "L": [
                            "A selection of verification measures is made for each release.",
                            "The rationale for selection is mostly clear, though not always formally documented.",
                            "Regression testing is performed based on experience and knowledge of changes.",
                            "The selection is reasonable and covers the main requirements and risks."
                        ],
                        "P": [
                            "The same full set of tests is run for every minor release, regardless of the changes (inefficient).",
                            "Or, only new features are tested, with no regression testing, leading to escapes.",
                            "The selection is ad-hoc, with no clear strategy or documentation.",
                            "Requirements coverage is unknown."
                        ],
                        "N": [
                            "No selection of verification measures is performed; testing is chaotic and unplanned."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.5.BP3",
                "BP_title": "Perform verification of the integrated system.",
                "BP_statement": "Perform the verification of the integrated system using the selected verification measures. Record the verification results including pass/fail status and corresponding verification measure data.",
                "BP_key_obj": "Test Execution, Result Recording, Evidence Collection, Defect Reporting.",
                "BP_user_docs_needed": "Test Execution Log, Test Results, Defect Reports (see SUP.9), Evidence (e.g., logs, screenshots).",
                "BP_rating_rules": {
                        "F": [
                            "The fully integrated system is verified using the selected verification measures.",
                            "The results of each step (pass/fail status) are recorded accurately.",
                            "Objective evidence of the results (e.g., log files, measurement data, photos) is collected and stored.",
                            "All deviations from expected results (failures) are documented in a problem resolution system (see SUP.9).",
                            "The test environment and system/item versions are recorded for each test run."
                        ],
                        "L": [
                            "System verification is performed.",
                            "Results are recorded, but supporting evidence might not be collected for all tests.",
                            "Most failures are reported, but some may be fixed informally without a record.",
                            "The process is largely effective at finding defects."
                        ],
                        "P": [
                            "Only a subset of the selected tests is executed.",
                            "Test results are not formally recorded (e.g., a simple verbal 'it's done').",
                            "Failures are not systematically reported, leading to them not being fixed or reappearing later.",
                            "The verification is unreliable."
                        ],
                        "N": [
                            "No system verification is performed, or if it is, no records are kept."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.5.BP4",
                "BP_title": "Ensure consistency and establish bidirectional traceability.",
                "BP_statement": "Ensure consistency and establish bidirectional traceability between verification measures and system requirements. Establish bidirectional traceability between verification results and verification measures.",
                "BP_key_obj": "Requirements Coverage Analysis, Traceability, Consistency, Status Reporting.",
                "BP_user_docs_needed": "Requirements-to-Test-Case Traceability Matrix, Test-Case-to-Test-Result Traceability, Consistency Analysis Report, Test Coverage Report.",
                "BP_rating_rules": {
                        "F": [
                            "Bidirectional traceability is established between each system requirement and the verification measure(s) that test it.",
                            "Bidirectional traceability is established between every executed verification measure and its corresponding result.",
                            "A consistency check is performed to ensure the verification measures are appropriate for the requirements they trace to.",
                            "Coverage analysis demonstrates that all system requirements in scope for the release are tested."
                        ],
                        "L": [
                            "Traceability is established for most verification measures to the system requirements.",
                            "Traceability from test results back to the test cases exists.",
                            "There may be minor gaps or inconsistencies in the traceability.",
                            "Coverage is largely complete for prioritized requirements."
                        ],
                        "P": [
                            "Traceability is sporadic or only exists in one direction.",
                            "It is difficult to determine which requirements have been tested.",
                            "It is difficult to find the result for a specific test case.",
                            "Requirements test coverage is unknown."
                        ],
                        "N": [
                            "No traceability is established."
                        ]
                    }
            },
            {
                "BP_ID": "SYS.5.BP5",
                "BP_title": "Summarize and communicate results.",
                "BP_statement": "Summarize the system verification results and communicate them to all affected parties.",
                "BP_key_obj": "Reporting, Communication, Quality Assessment, Release Decision Support.",
                "BP_user_docs_needed": "System Verification Summary Report, Communication Evidence (e.g., emails, meeting minutes), Defect Summary Report, Requirements Coverage Statistics.",
                "BP_rating_rules": {
                        "F": [
                            "A summary report is created at the conclusion of the verification cycle.",
                            "The report includes a summary of executed tests, pass/fail statistics, a list of open defects with severity, and a statement on requirements coverage.",
                            "The report provides a clear assessment of product quality against the requirements and remaining risks.",
                            "The report is communicated to all affected parties to support release decisions."
                        ],
                        "L": [
                            "Results are summarized and communicated, for example, in project status meetings.",
                            "The summary provides a good overview of the product quality, although it may not be a formal, standalone report.",
                            "Key stakeholders are informed of the verification status and major issues."
                        ],
                        "P": [
                            "Only raw test logs or a list of defects are provided, without any summary or analysis.",
                            "Communication is ad-hoc or non-existent.",
                            "Stakeholders are not aware of the product's quality or its readiness for release."
                        ],
                        "N": [
                            "No summary or communication of results occurs."
                        ]
                    }
            }
        ],
    "SWE.1":[
        {
            "BP_ID": "SWE.1.BP1",
            "BP_title": "Specify software requirements",
            "BP_statement": "Use the system requirements and the system architecture to identify and document the functional and non-functional requirements for the software according to defined characteristics for requirements.",
            "BP_key_obj": "To ensure that all necessary software requirements are derived from system-level inputs, documented clearly, and possess defined quality characteristics (e.g., unambiguous, verifiable, consistent) to form a solid basis for software development.",
            "BP_user_docs_needed": [
                "Software Requirements Specification (SRS)",
                "System Requirements Specification",
                "System Architecture Document",
                "Requirements Traceability Matrix",
                "Review records for the SRS"
            ],
            "BP_rating_rules": {
                "F": [
                    "A version-controlled Software Requirements Specification (SRS) exists.",
                    "All software-relevant requirements from the system requirements and system architecture are covered.",
                    "Each software requirement is documented with defined characteristics (e.g., uniquely identified, verifiable, consistent, technically feasible).",
                    "Functional and non-functional requirements are clearly distinguished.",
                    "Verification criteria are defined for each requirement, enabling test case development.",
                    "Evidence of formal review and approval exists, and all identified issues are resolved."
                ],
                "L": [
                    "An SRS exists and the vast majority of system-level inputs are covered.",
                    "Most requirements meet the defined characteristics, but a few minor issues exist (e.g., slight ambiguity, minor inconsistencies) that do not hinder development.",
                    "Verification criteria are present for most requirements but might lack detail in some cases.",
                    "The SRS is a reliable basis for software design, with only minor clarifications needed."
                ],
                "P": [
                    "An SRS exists, but it has significant gaps in coverage from system requirements or architecture.",
                    "A significant number of requirements are of poor quality (e.g., ambiguous, non-verifiable, contradictory).",
                    "Verification criteria are frequently missing or inadequate.",
                    "The document requires substantial rework before it can be reliably used for design."
                ],
                "N": [
                    "No SRS document exists.",
                    "The SRS is merely a copy of system requirements without any software-specific analysis or refinement.",
                    "The document is so incomplete or of such poor quality that it provides no value to the development process."
                ]
            }
        },
        {
            "BP_ID": "SWE.1.BP2",
            "BP_title": "Structure software requirements",
            "BP_statement": "Structure and prioritize the software requirements.",
            "BP_key_obj": "To organize software requirements in a logical and manageable way (e.g., by feature, component) and to assign priorities to guide development, testing, and release planning.",
            "BP_user_docs_needed": [
                "Software Requirements Specification (SRS) with attributes for structure and priority",
                "Release Plan",
                "Project Management Plan"
            ],
            "BP_rating_rules": {
                "F": [
                    "Software requirements are systematically grouped or structured according to defined criteria (e.g., by feature, functionality, product variant).",
                    "Each requirement has a defined priority that is aligned with project and stakeholder needs (e.g., release scope).",
                    "The rationale for the structure and prioritization is documented and understood by the team."
                ],
                "L": [
                    "Most requirements are structured and prioritized.",
                    "The structuring scheme is mostly consistent, with a few minor exceptions.",
                    "Prioritization is generally clear but may require minor clarification for a small subset of requirements."
                ],
                "P": [
                    "A structure exists but is inconsistently applied or illogical.",
                    "Prioritization is missing for many requirements or is not based on clear criteria.",
                    "The organization of requirements is confusing and hinders efficient development and planning."
                ],
                "N": [
                    "No attempt has been made to structure or prioritize the requirements.",
                    "The requirements are presented as a simple, unorganized list."
                ]
            }
        },
        {
            "BP_ID": "SWE.1.BP3",
            "BP_title": "Analyze software requirements",
            "BP_statement": "Analyze the specified software requirements including their interdependencies to ensure correctness, technical feasibility, and to support project management regarding project estimates.",
            "BP_key_obj": "To critically evaluate software requirements for potential issues like conflicts, technical impossibilities, and risks, and to use this analysis to create reliable project estimates.",
            "BP_user_docs_needed": [
                "Analysis Results (e.g., review protocols, feasibility studies, prototypes)",
                "Software Requirements Specification (SRS)",
                "Project estimates (effort, cost, schedule)",
                "Risk Management Plan"
            ],
            "BP_rating_rules": {
                "F": [
                    "There is documented evidence of analysis for correctness, technical feasibility, and interdependencies.",
                    "Analysis methods (e.g., reviews, prototyping, simulation) are appropriate and systematically applied.",
                    "Issues found during analysis are tracked to resolution.",
                    "The results of the analysis are used as a documented basis for project estimates (effort, schedule).",
                    "Potential risks related to requirements are identified."
                ],
                "L": [
                    "Most requirements have been analyzed, but the analysis of interdependencies might be superficial in some areas.",
                    "Technical feasibility is confirmed for all critical requirements.",
                    "Estimates are largely based on the analysis, but the link may not be formally documented for all tasks."
                ],
                "P": [
                    "Analysis is performed sporadically or only for a subset of requirements.",
                    "There is no evidence of analysis for interdependencies or technical feasibility.",
                    "Project estimates are created without a clear, analytical basis derived from the requirements."
                ],
                "N": [
                    "No evidence of any analysis of the software requirements exists.",
                    "Requirements are accepted without evaluating their feasibility or impact."
                ]
            }
        },
        {
            "BP_ID": "SWE.1.BP4",
            "BP_title": "Analyze the impact on the operating environment",
            "BP_statement": "Analyze the impact that the software requirements will have on elements in the operating environment.",
            "BP_key_obj": "To ensure that the effects of the software on the system's hardware, other software components, and external systems are understood, documented, and accounted for.",
            "BP_user_docs_needed": [
                "Analysis Results",
                "Hardware-Software Interface (HSI) Specification",
                "System Architecture Document"
            ],
            "BP_rating_rules": {
                "F": [
                    "A systematic analysis of the impact on the operating environment (e.g., memory usage, CPU load, network bandwidth, hardware interfaces) is documented.",
                    "The analysis covers all relevant software requirements.",
                    "The results are used to refine requirements, system architecture, or hardware specifications."
                ],
                "L": [
                    "An impact analysis was performed, covering the most critical requirements and environmental aspects.",
                    "Some less critical impacts may not be fully documented, but the overall system behavior is understood."
                ],
                "P": [
                    "The analysis is incomplete, missing major environmental factors or requirements.",
                    "The analysis is superficial and does not provide enough detail to identify potential problems."
                ],
                "N": [
                    "No analysis of the impact on the operating environment was performed."
                ]
            }
        },
        {
            "BP_ID": "SWE.1.BP5",
            "BP_title": "Ensure consistency and establish bidirectional traceability",
            "BP_statement": "Ensure consistency and establish bidirectional traceability between software requirements and system architecture. Ensure consistency and establish bidirectional traceability between software requirements and system requirements.",
            "BP_key_obj": "To create and maintain links between software requirements and their sources (system requirements, system architecture) to ensure that nothing is missed (completeness), nothing extra is added without reason (gold plating), and impacts of changes can be effectively managed.",
            "BP_user_docs_needed": [
                "Consistency Evidence (e.g., traceability matrix, review records)",
                "Software Requirements Specification (SRS)",
                "System Requirements Specification",
                "System Architecture Document"
            ],
            "BP_rating_rules": {
                "F": [
                    "Complete bidirectional traceability is established and maintained between each software requirement and its parent system requirement(s) and system architecture element(s).",
                    "A consistency check has been performed to ensure traced items are compatible and not contradictory.",
                    "The traceability data is up-to-date and reflects the current state of the documents.",
                    "Tools are used effectively to manage traceability links."
                ],
                "L": [
                    "Traceability is largely complete, with only a few minor gaps or outdated links for non-critical items.",
                    "Consistency has been checked, and no major inconsistencies exist.",
                    "The traceability is sufficient for effective impact analysis of most changes."
                ],
                "P": [
                    "Significant gaps exist in the traceability (e.g., many requirements are not traced).",
                    "Traceability is only unidirectional, or links are frequently outdated or incorrect.",
                    "No evidence of a consistency check is available.",
                    "Impact analysis is difficult or unreliable due to the poor state of traceability."
                ],
                "N": [
                    "No traceability exists.",
                    "The concept of linking requirements to their source is not implemented."
                ]
            }
        },
        {
            "BP_ID": "SWE.1.BP6",
            "BP_title": "Communicate agreed software requirements and impact on the operating environment",
            "BP_statement": "Communicate the agreed software requirements, and the results of the analysis of impact on the operating environment, to all affected parties.",
            "BP_key_obj": "To ensure that all stakeholders (e.g., developers, testers, project managers) have access to and are working from the same approved version of the software requirements and understand their implications.",
            "BP_user_docs_needed": [
                "Communication Evidence (e.g., meeting minutes, email distributions, release notes for documents)",
                "Software Requirements Specification (formally released/baselined)",
                "List of affected parties"
            ],
            "BP_rating_rules": {
                "F": [
                    "A mechanism for communicating agreed requirements is defined and consistently used.",
                    "There is clear evidence (e.g., distribution lists, meeting records, notifications from a tool) that all affected parties have received the agreed-upon requirements and analysis results.",
                    "The communicated requirements are clearly identified as the official, approved baseline."
                ],
                "L": [
                    "Communication occurs, and all key stakeholders have received the information.",
                    "The process might be slightly informal, or evidence may not be perfectly logged, but the intended recipients are verifiably informed."
                ],
                "P": [
                    "Communication is ad-hoc and inconsistent.",
                    "Some affected parties are not informed, leading to teams working with outdated or incorrect information.",
                    "It is unclear which version of the requirements is the official one."
                ],
                "N": [
                    "No communication of agreed requirements takes place.",
                    "Documents are finalized but not distributed to the teams that need them."
                ]
            }
        }
    ],
    "SWE.2":[
        {
            "BP_ID": "SWE.2.BP1",
            "BP_title": "Specify static aspects of the software architecture",
            "BP_statement": "Specify and document the static aspects of the software architecture with respect to the functional and non-functional software requirements, including external interfaces and a defined set of software components with their interfaces and relationships.",
            "BP_key_obj": "To define and document the structural blueprint of the software, identifying its main building blocks (components), their responsibilities, how they are connected (interfaces), and how they relate to each other.",
            "BP_user_docs_needed": [
                "Software Architecture Document",
                "Software Requirements Specification (SRS)",
                "Interface specification documents"
            ],
            "BP_rating_rules": {
                "F": [
                    "A software architecture document exists and is under version control.",
                    "The software is decomposed into a set of software components.",
                    "For each component, its responsibilities are defined.",
                    "Interfaces between components and to the external environment are specified, including data types and protocols.",
                    "The relationships between components (e.g., dependencies, hierarchy) are clearly documented.",
                    "The design fulfills the relevant functional and non-functional software requirements."
                ],
                "L": [
                    "The static architecture is well-documented, covering all major components and interfaces.",
                    "Some minor details in interface specifications or component relationships might be missing but can be easily inferred and do not block development."
                ],
                "P": [
                    "The architecture document is incomplete; major components or interfaces are missing or poorly defined.",
                    "The decomposition is illogical or does not adequately address the software requirements.",
                    "The document is not a sufficient guide for detailed design."
                ],
                "N": [
                    "No software architecture document or static design exists.",
                    "The design is just a 'box diagram' with no detail on interfaces or component responsibilities."
                ]
            }
        },
        {
            "BP_ID": "SWE.2.BP2",
            "BP_title": "Specify dynamic aspects of the software architecture",
            "BP_statement": "Specify and document the dynamic aspects of the software architecture with respect to the functional and non-functional software requirements, including the behavior of the software components and their interaction in different software modes, and concurrency aspects.",
            "BP_key_obj": "To describe how the software components work together over time to achieve the system's functions, including handling sequences of events, managing different operational modes, and dealing with concurrent activities.",
            "BP_user_docs_needed": [
                "Software Architecture Document (containing dynamic views)",
                "Sequence diagrams, state charts, or other behavioral models",
                "Software Requirements Specification (SRS)"
            ],
            "BP_rating_rules": {
                "F": [
                    "The dynamic behavior of the software is documented using appropriate methods (e.g., sequence diagrams, state machines, timing diagrams).",
                    "The documentation covers interactions between software components for key scenarios.",
                    "Different software modes (e.g., startup, normal operation, shutdown, fault) and the transitions between them are described.",
                    "Concurrency aspects (e.g., task scheduling, interrupt handling, resource sharing) are specified."
                ],
                "L": [
                    "The main dynamic behaviors are documented, and key interactions are clear.",
                    "Descriptions of some secondary scenarios or error conditions might be less detailed, but the core functionality is covered.",
                    "Concurrency is addressed, but some details about resource locking or priority inversion might be implicit."
                ],
                "P": [
                    "Dynamic aspects are only superficially described or are missing for critical parts of the system.",
                    "Concurrency aspects are not considered, posing a risk of race conditions or deadlocks.",
                    "The documentation fails to explain how components interact to fulfill major use cases."
                ],
                "N": [
                    "No documentation of dynamic aspects exists.",
                    "The architecture only describes what the components are, not what they do or how they interact."
                ]
            }
        },
        {
            "BP_ID": "SWE.2.BP3",
            "BP_title": "Analyze software architecture",
            "BP_statement": "Analyze the software architecture regarding relevant technical design aspects and to support project management regarding project estimates. Document a rationale for the software architectural design decision.",
            "BP_key_obj": "To ensure the proposed architecture is fit for purpose by evaluating it against key quality attributes (e.g., performance, resource usage, maintainability) and to justify why specific design choices were made.",
            "BP_user_docs_needed": [
                "Analysis Results (e.g., trade-off studies, simulation results, resource calculations)",
                "Software Architecture Document (including design rationale)",
                "Project estimates"
            ],
            "BP_rating_rules": {
                "F": [
                    "There is documented evidence of analysis against technical aspects like timing, resource consumption (RAM/ROM), and feasibility.",
                    "The analysis methods used (e.g., prototyping, simulation, qualitative analysis) are appropriate.",
                    "A clear rationale for significant architectural decisions is documented (e.g., make vs. buy, pattern selection).",
                    "The results of the analysis are used to refine project estimates."
                ],
                "L": [
                    "The architecture has been analyzed for the most critical technical aspects.",
                    "The rationale for major decisions is documented, although justification for minor decisions may be missing.",
                    "The analysis is sufficient to have confidence in the architecture's viability."
                ],
                "P": [
                    "Analysis is missing for key non-functional requirements (e.g., performance is required but no analysis was done).",
                    "No rationale is documented, making the design choices seem arbitrary.",
                    "Project estimates do not appear to be based on any architectural analysis."
                ],
                "N": [
                    "No analysis of the software architecture has been performed.",
                    "The design has been created without evaluation or justification."
                ]
            }
        },
        {
            "BP_ID": "SWE.2.BP4",
            "BP_title": "Ensure consistency and establish bidirectional traceability",
            "BP_statement": "Ensure consistency and establish bidirectional traceability between the software architecture and the software requirements.",
            "BP_key_obj": "To link architectural elements to the software requirements they are designed to satisfy, ensuring every requirement is addressed by the architecture and every part of the architecture exists for a reason.",
            "BP_user_docs_needed": [
                "Consistency Evidence (e.g., traceability matrix, review records)",
                "Software Architecture Document",
                "Software Requirements Specification (SRS)"
            ],
            "BP_rating_rules": {
                "F": [
                    "Complete bidirectional traceability is established between software architecture components/interfaces and the software requirements.",
                    "A consistency check has been performed to ensure the architecture correctly implements the intent of the traced requirements.",
                    "Traceability is up-to-date and used for impact analysis.",
                    "Unallocated requirements are identified and handled."
                ],
                "L": [
                    "Traceability is largely complete, with only minor gaps for non-critical requirements.",
                    "No major inconsistencies exist between the architecture and the requirements.",
                    "The traceability is mostly reliable for impact analysis."
                ],
                "P": [
                    "Significant gaps exist in the traceability; many requirements are not linked to the architecture, or vice versa.",
                    "Traceability is outdated or incorrect.",
                    "The architecture is visibly inconsistent with the requirements (e.g., a required interface is missing)."
                ],
                "N": [
                    "No traceability between architecture and requirements exists."
                ]
            }
        },
        {
            "BP_ID": "SWE.2.BP5",
            "BP_title": "Communicate agreed software architecture",
            "BP_statement": "Communicate the agreed software architecture to all affected parties.",
            "BP_key_obj": "To ensure that all relevant teams (e.g., detailed designers, component developers, integrators, testers) are working from the same approved architectural design.",
            "BP_user_docs_needed": [
                "Communication Evidence (e.g., meeting minutes, email distributions, release notes)",
                "Software Architecture Document (formally released/baselined)",
                "List of affected parties"
            ],
            "BP_rating_rules": {
                "F": [
                    "A mechanism for communicating the agreed architecture is defined and consistently used.",
                    "There is clear evidence that all affected parties have received the agreed-upon architecture.",
                    "The communicated architecture is clearly identified as the official, approved baseline for development."
                ],
                "L": [
                    "Communication occurs, and all key stakeholders have received the architecture document.",
                    "The process might be slightly informal, but the intended recipients are verifiably informed and using the correct version."
                ],
                "P": [
                    "Communication is ad-hoc, and some teams are not informed.",
                    "It is unclear which version of the architecture is the official one, leading to potential integration problems."
                ],
                "N": [
                    "No communication of the agreed architecture takes place.",
                    "The architecture document is not distributed to the teams that need it for their work."
                ]
            }
        }
    ],
    "SWE.3":[
        {
            "BP_ID": "SWE.3.BP1",
            "BP_title": "Specify the static aspects of the detailed design",
            "BP_statement": "For each software component specify the behavior of its software units, their static structure and relationships, their interfaces including valid data value ranges for inputs and outputs (from the application domain perspective), and physical or measurement units applicable to inputs and outputs (from the application domain perspective).",
            "BP_key_obj": "To break down architectural components into smaller, implementable units (e.g., functions, classes), and precisely define their structure, interfaces, and data handling, including physical units and ranges.",
            "BP_user_docs_needed": [
                "Software Detailed Design Document",
                "Software Architecture Document",
                "Interface specifications for software units"
            ],
            "BP_rating_rules": {
                "F": [
                    "A software detailed design (SDD) document exists for the software units within each component.",
                    "The static structure, relationships, and interfaces of all software units are defined.",
                    "Interfaces specifications include data types, valid value ranges (e.g., 0-100), and physical units (e.g., 'km/h', '%') where applicable.",
                    "The detailed design is consistent with the software architecture."
                ],
                "L": [
                    "An SDD exists and covers the design for most units.",
                    "Interface definitions are mostly complete, though some physical units or ranges for non-critical signals might be missing.",
                    "The design is a solid basis for coding."
                ],
                "P": [
                    "The SDD is incomplete, missing the design for significant software units.",
                    "Interface definitions are frequently missing critical details like value ranges, making implementation ambiguous and error-prone.",
                    "The design is inconsistent with the parent architecture."
                ],
                "N": [
                    "No software detailed design exists.",
                    "Developers proceed to code directly from the architecture without a detailed design step."
                ]
            }
        },
        {
            "BP_ID": "SWE.3.BP2",
            "BP_title": "Specify dynamic aspects of the detailed design",
            "BP_statement": "Specify and document the dynamic aspects of the detailed design with respect to the software architecture, including the interactions between relevant software units to fulfill the component’s dynamic behavior.",
            "BP_key_obj": "To describe the internal logic and flow of control within a software component, showing how its constituent software units interact to produce the component's overall behavior.",
            "BP_user_docs_needed": [
                "Software Detailed Design Document (with dynamic views)",
                "Sequence diagrams, activity diagrams, or pseudo-code describing internal logic",
                "Software Architecture Document"
            ],
            "BP_rating_rules": {
                "F": [
                    "The dynamic behavior within components is documented (e.g., via pseudo-code, flowcharts, activity diagrams).",
                    "The documentation clearly shows the sequence of operations and interactions between software units for important functions.",
                    "The detailed dynamic behavior is consistent with the high-level dynamic behavior specified in the architecture."
                ],
                "L": [
                    "The main algorithms and dynamic interactions are documented.",
                    "Detailed error handling logic or behavior in edge cases may not be fully specified but the primary path is clear."
                ],
                "P": [
                    "Dynamic behavior is only documented for a few units or is described in a vague, high-level way that does not add detail to the architecture.",
                    "The internal logic of complex components is not explained."
                ],
                "N": [
                    "No description of the dynamic aspects of the detailed design exists."
                ]
            }
        },
        {
            "BP_ID": "SWE.3.BP3",
            "BP_title": "Develop software units",
            "BP_statement": "Develop and document the software units consistent with the detailed design, and according to coding principles.",
            "BP_key_obj": "To translate the detailed design of software units into actual source code that is well-documented, clean, and adheres to established coding standards.",
            "BP_user_docs_needed": [
                "Source code for software units",
                "Software Detailed Design Document",
                "Coding guidelines/standard",
                "Code comments and documentation"
            ],
            "BP_rating_rules": {
                "F": [
                    "The source code for software units is implemented and complete.",
                    "The implementation is demonstrably consistent with the software detailed design.",
                    "Defined coding principles/guidelines (e.g., MISRA C, internal style guide) are systematically followed.",
                    "The code is well-structured and documented with comments where necessary."
                ],
                "L": [
                    "The source code is complete and largely follows the detailed design and coding guidelines.",
                    "There may be minor, isolated deviations from the coding standard that do not affect functionality or maintainability."
                ],
                "P": [
                    "The source code is inconsistent with the detailed design in significant ways.",
                    "Coding guidelines are frequently violated.",
                    "The code is poorly structured or lacks documentation, making it difficult to understand and maintain."
                ],
                "N": [
                    "Software units have not been developed.",
                    "The developed code bears no resemblance to the detailed design."
                ]
            }
        },
        {
            "BP_ID": "SWE.3.BP4",
            "BP_title": "Ensure consistency and establish bidirectional traceability",
            "BP_statement": "Ensure consistency and establish bidirectional traceability between the software detailed design and the software architecture. Ensure consistency and establish bidirectional traceability between the developed software units and the software detailed design. Ensure consistency and establish traceability between the software detailed design and the software requirements.",
            "BP_key_obj": "To create a complete and consistent chain of links from requirements to architecture to detailed design to code, ensuring full coverage and enabling robust impact analysis.",
            "BP_user_docs_needed": [
                "Consistency Evidence (e.g., traceability matrix, review records)",
                "Software Requirements Specification (SRS)",
                "Software Architecture Document",
                "Software Detailed Design Document",
                "Source Code (with traceability tags if applicable)"
            ],
            "BP_rating_rules": {
                "F": [
                    "Bidirectional traceability is established and maintained for: SDD <-> Architecture, Code <-> SDD, and SDD <-> SRS.",
                    "The traceability links are complete, correct, and up-to-date.",
                    "Consistency checks have been performed across all levels of abstraction.",
                    "The traceability provides a clear path from a specific line of code back to the requirement it helps fulfill."
                ],
                "L": [
                    "Traceability is largely complete and consistent across all required links.",
                    "There may be a few minor gaps or outdated links, but the overall traceability is reliable for impact analysis and coverage checks."
                ],
                "P": [
                    "Traceability is missing for one or more of the required links (e.g., no link from code to design).",
                    "Significant gaps or errors exist in the traceability that is present.",
                    "It is difficult or impossible to determine if the design and code fully cover the requirements."
                ],
                "N": [
                    "No traceability has been established between design, code, architecture, or requirements."
                ]
            }
        },
        {
            "BP_ID": "SWE.3.BP5",
            "BP_title": "Communicate agreed software detailed design and developed software units",
            "BP_statement": "Communicate the agreed software detailed design and developed software units to all affected parties.",
            "BP_key_obj": "To ensure that relevant stakeholders (e.g., testers, integrators) have access to the approved detailed design and the corresponding source code for their work.",
            "BP_user_docs_needed": [
                "Communication Evidence (e.g., check-in notifications, release notes)",
                "Software Detailed Design Document (formally released/baselined)",
                "Version control system logs for source code check-ins"
            ],
            "BP_rating_rules": {
                "F": [
                    "A mechanism for communicating the agreed detailed design and making source code available is defined and used.",
                    "There is clear evidence that affected parties have access to the approved SDD and the corresponding software units (e.g., via a version control system).",
                    "It is clear which versions of the design and code are approved for use in integration and testing."
                ],
                "L": [
                    "Communication occurs and the relevant artifacts are available to the team.",
                    "The process might be slightly informal (e.g., relying on daily stand-ups and a well-maintained repository) but is effective in practice."
                ],
                "P": [
                    "Communication is ad-hoc, and testers or integrators may be working with outdated design documents or code.",
                    "It is difficult to find the correct version of the source code or design."
                ],
                "N": [
                    "No communication takes place.",
                    "The detailed design is not distributed, and code is not checked into a shared repository."
                ]
            }
        }
    ],
    "SWE.4":[
        {
            "BP_ID": "SWE.4.BP1",
            "BP_title": "Specify software unit verification measures",
            "BP_statement": "Specify verification measures for each software unit defined in the software detailed design, including pass/fail criteria for verification measures, entry and exit criteria for verification measures, and the required verification infrastructure.",
            "BP_key_obj": "To define a clear and comprehensive strategy for how each software unit will be verified, ensuring that the verification process is planned, repeatable, and has objective criteria for success.",
            "BP_user_docs_needed": [
                "Unit Verification Specification / Test Plan",
                "Software Detailed Design Document",
                "Static Analysis Ruleset/Configuration",
                "Code Review Checklists"
            ],
            "BP_rating_rules": {
                "F": [
                    "A verification specification exists that defines the verification measures (e.g., static analysis, code review, unit tests) for software units.",
                    "The specification is based on the software detailed design.",
                    "Clear and unambiguous pass/fail criteria are defined for each verification measure.",
                    "Entry/exit criteria for performing the verification are defined (e.g., code must compile without warnings).",
                    "The required test environment/infrastructure is specified."
                ],
                "L": [
                    "Verification measures are specified for almost all units.",
                    "Pass/fail criteria are mostly clear, though some may require minor interpretation.",
                    "The overall verification strategy is sound and covers the critical aspects of the units."
                ],
                "P": [
                    "Verification measures are specified for only a subset of units.",
                    "Pass/fail criteria are frequently missing, vague, or subjective (e.g., 'works as expected').",
                    "The specification is insufficient to guide a systematic verification effort."
                ],
                "N": [
                    "No specification of unit verification measures exists.",
                    "Verification is unplanned and entirely ad-hoc."
                ]
            }
        },
        {
            "BP_ID": "SWE.4.BP2",
            "BP_title": "Select software unit verification measures",
            "BP_statement": "Document the selection of verification measures considering selection criteria including criteria for regression verification. The documented selection of verification measures shall have sufficient coverage according to the release scope.",
            "BP_key_obj": "To choose and justify the specific set of verification activities that will be performed for a given release, ensuring adequate testing coverage without unnecessary effort, and defining a strategy for re-testing after changes.",
            "BP_user_docs_needed": [
                "Verification Measure Selection Set (e.g., Test Suite for a release)",
                "Unit Verification Specification / Test Plan",
                "Release Plan",
                "Change Requests / Impact Analysis for regression"
            ],
            "BP_rating_rules": {
                "F": [
                    "The selection of verification measures for the current release is documented.",
                    "The selection provides sufficient coverage of the unit's requirements/design for the release scope.",
                    "A clear strategy and criteria for regression verification are defined and applied (i.e., which tests to re-run when a change is made).",
                    "The rationale for the selection is documented."
                ],
                "L": [
                    "A selection of verification measures is performed and documented.",
                    "The coverage is adequate for the release, though the formal documentation of the selection rationale may be sparse.",
                    "Regression testing is performed, but the strategy might not be explicitly documented."
                ],
                "P": [
                    "The selection of verification measures is not documented.",
                    "There is no evidence of a regression strategy; either too much or too little is re-tested after changes.",
                    "The coverage provided by the selected tests is insufficient for the release scope."
                ],
                "N": [
                    "No selection of verification measures is performed.",
                    "It is unclear which tests are run for any given release."
                ]
            }
        },
        {
            "BP_ID": "SWE.4.BP3",
            "BP_title": "Verify software units",
            "BP_statement": "Perform software unit verification using the selected verification measures. Record the verification results including pass/fail status and corresponding verification measure data.",
            "BP_key_obj": "To execute the planned verification activities (reviews, static analysis, tests) and to systematically capture the results to provide objective evidence of the unit's quality.",
            "BP_user_docs_needed": [
                "Verification Results (e.g., Unit Test Reports, Static Analysis Reports, Code Review Records)",
                "Verification Measure Data (e.g., test logs, tool outputs)",
                "Problem/Defect Reports"
            ],
            "BP_rating_rules": {
                "F": [
                    "The selected verification measures have been performed.",
                    "Results are recorded for all executed measures.",
                    "Each result includes a clear pass/fail status.",
                    "The recorded data is sufficient to understand what was done and reproduce the result (e.g., tool version, inputs, outputs).",
                    "Deviations from expected results are documented (e.g., in a defect tracking system)."
                ],
                "L": [
                    "Verification has been performed for the vast majority of selected measures.",
                    "Results are recorded with pass/fail status, but the supporting data might occasionally lack some detail.",
                    "The overall status of the units is clear."
                ],
                "P": [
                    "Verification is only partially performed.",
                    "Results are not systematically recorded, or the pass/fail status is often missing.",
                    "It is difficult to determine the quality and status of the software units based on the available records."
                ],
                "N": [
                    "No verification of software units has been performed.",
                    "No verification results are recorded."
                ]
            }
        },
        {
            "BP_ID": "SWE.4.BP4",
            "BP_title": "Ensure consistency and establish bidirectional traceability",
            "BP_statement": "Ensure consistency and establish bidirectional traceability between verification measures and the software units defined in the detailed design. Establish bidirectional traceability between the verification results and the verification measures.",
            "BP_key_obj": "To link tests to the design they verify, and test results to the tests that were executed, ensuring that all units are tested, all tests are run, and the origin of any failure can be quickly identified.",
            "BP_user_docs_needed": [
                "Consistency Evidence (e.g., traceability matrix)",
                "Unit Verification Specification",
                "Software Detailed Design Document",
                "Verification Results"
            ],
            "BP_rating_rules": {
                "F": [
                    "Complete bidirectional traceability exists between unit verification measures and the software units in the detailed design.",
                    "Complete bidirectional traceability exists between verification results and the corresponding verification measures.",
                    "Consistency checks are performed to ensure tests are appropriate for the design.",
                    "The traceability is up-to-date and allows for easy assessment of test coverage and result status."
                ],
                "L": [
                    "Traceability is largely complete and consistent.",
                    "There may be a few minor gaps or outdated links, but the relationship between design, tests, and results is clear.",
                    "Coverage can be reliably assessed."
                ],
                "P": [
                    "Significant gaps exist in the traceability (e.g., many test cases are not linked to the design).",
                    "Test results are not linked back to the test cases, making it hard to manage re-testing.",
                    "It is difficult to determine the test coverage of the detailed design."
                ],
                "N": [
                    "No traceability exists between design, verification measures, and results."
                ]
            }
        },
        {
            "BP_ID": "SWE.4.BP5",
            "BP_title": "Summarize and communicate results",
            "BP_statement": "Summarize the results of software unit verification and communicate them to all affected parties.",
            "BP_key_obj": "To consolidate the detailed verification results into a concise summary that enables stakeholders (e.g., integrators, project managers) to understand the quality status of the software units and make informed decisions.",
            "BP_user_docs_needed": [
                "Communication Evidence (e.g., summary report, email)",
                "Unit Verification Summary Report",
                "Verification Results"
            ],
            "BP_rating_rules": {
                "F": [
                    "A summary of the unit verification results is created.",
                    "The summary provides a clear overview of the status, including coverage metrics, number of passed/failed tests, and open defects.",
                    "There is evidence that this summary has been communicated to all affected parties.",
                    "The summary enables stakeholders to judge readiness for integration."
                ],
                "L": [
                    "A summary of results is created and communicated.",
                    "The summary may lack some formal metrics but still provides a clear picture of the verification status.",
                    "All key stakeholders are informed."
                ],
                "P": [
                    "Only raw test logs or results are communicated without any summary or interpretation.",
                    "Communication is ad-hoc, or the summary is misleading or incomplete.",
                    "It is not possible to get a clear picture of the unit verification status."
                ],
                "N": [
                    "No summary is created or communicated.",
                    "The status of unit verification is unknown to other teams."
                ]
            }
        }
    ],
    "SWE.5":[
        {
            "BP_ID": "SWE.5.BP1",
            "BP_title": "Specify software integration verification measures",
            "BP_statement": "Specify verification measures, based on a defined sequence and preconditions for the integration of software elements, against the defined static and dynamic aspects of the software architecture, including techniques for the verification measures, pass/fail criteria for verification measures, entry and exit criteria for verification measures, and the required verification infrastructure and environment setup.",
            "BP_key_obj": "To develop a test strategy for verifying that integrated software components work together as specified in the software architecture, focusing on their interfaces, interactions, and timing.",
            "BP_user_docs_needed": [
                "Software Integration Test Specification / Plan",
                "Software Architecture Document",
                "Integration Sequence Instruction"
            ],
            "BP_rating_rules": {
                "F": [
                    "An integration verification specification exists that is based on the software architecture and integration sequence.",
                    "It specifies verification measures (tests) for interfaces and interactions between components.",
                    "Clear pass/fail, entry, and exit criteria are defined for the verification measures.",
                    "The required verification environment (e.g., SIL, HIL, debugger) is specified.",
                    "The strategy covers both static and dynamic aspects of the architecture."
                ],
                "L": [
                    "An integration verification specification exists and covers the most critical interactions and interfaces.",
                    "Pass/fail criteria are generally clear. Some entry/exit criteria may be implicit.",
                    "The overall strategy is sound for ensuring components work together."
                ],
                "P": [
                    "The specification is incomplete, missing tests for key interfaces or interactions.",
                    "Pass/fail criteria are frequently vague or missing.",
                    "The specified tests do not adequately verify the software architecture."
                ],
                "N": [
                    "No integration verification specification exists.",
                    "Integration testing is performed without a plan or predefined test cases."
                ]
            }
        },
        {
            "BP_ID": "SWE.5.BP2",
            "BP_title": "Specify verification measures for verifying software component behavior",
            "BP_statement": "Specify verification measures for software component verification against the defined software components’ behavior and their interfaces in the software architecture, including techniques for the verification measures, entry and exit criteria for verification measures, pass/fail criteria for verification measures, and the required verification infrastructure and environment setup.",
            "BP_key_obj": "To define a test strategy for verifying that individual software components, treated as black boxes, meet their specified behavior and interface requirements as defined in the software architecture.",
            "BP_user_docs_needed": [
                "Software Component Test Specification / Plan",
                "Software Architecture Document"
            ],
            "BP_rating_rules": {
                "F": [
                    "A verification specification exists for verifying individual software components against the architecture.",
                    "Verification measures are defined to test the component's external behavior and interfaces.",
                    "Clear pass/fail, entry, and exit criteria are defined for these measures.",
                    "The required verification environment is specified."
                ],
                "L": [
                    "A component verification specification exists and covers the key behaviors of the components.",
                    "Criteria are mostly clear, and the strategy is sufficient to gain confidence in the components before integration."
                ],
                "P": [
                    "The specification is incomplete, with many component behaviors or interfaces not covered by tests.",
                    "Criteria are often missing or vague.",
                    "The specified tests are insufficient to confirm component correctness."
                ],
                "N": [
                    "No component verification specification exists."
                ]
            }
        },
        {
            "BP_ID": "SWE.5.BP3",
            "BP_title": "Select verification measures",
            "BP_statement": "Document the selection of integration verification measures for each integration step considering selection criteria including criteria for regression verification. The documented selection of verification measures shall have sufficient coverage according to the release scope.",
            "BP_key_obj": "To choose and justify the specific set of integration and component tests to be executed for a release or integration step, ensuring adequate coverage and defining a regression strategy for changes.",
            "BP_user_docs_needed": [
                "Verification Measure Selection Set (e.g., Test Suite for a release)",
                "Integration Test Specification / Component Test Specification",
                "Release Plan",
                "Change Requests / Impact Analysis for regression"
            ],
            "BP_rating_rules": {
                "F": [
                    "The selection of component and integration verification measures for the current release/integration step is documented.",
                    "The selection provides sufficient coverage of the architecture for the release scope.",
                    "A clear strategy and criteria for regression verification are defined and applied.",
                    "The rationale for the selection is documented."
                ],
                "L": [
                    "A selection of verification measures is performed and documented.",
                    "Coverage is adequate for the release. The regression strategy is followed but may not be explicitly documented.",
                    "The rationale for selection is understood by the team."
                ],
                "P": [
                    "The selection of tests is not documented.",
                    "The regression strategy is ad-hoc, leading to inefficient re-testing.",
                    "The coverage provided by the selected tests is insufficient for the release scope or integration step."
                ],
                "N": [
                    "No selection of verification measures is performed.",
                    "It is unclear which integration tests are relevant for a given release."
                ]
            }
        },
        {
            "BP_ID": "SWE.5.BP4",
            "BP_title": "Integrate software elements and perform integration verification",
            "BP_statement": "Integrate the software elements until the software is fully integrated according to the specified interfaces and interactions between the Software elements, and according to the defined sequence and defined preconditions. Perform the selected integration verification measures. Record the verification measure data including pass/fail status and corresponding verification measure data.",
            "BP_key_obj": "To assemble the software components according to a defined plan and execute the planned integration tests at each step, recording the results to prove that the integrated parts work together correctly.",
            "BP_user_docs_needed": [
                "Integration Verification Results",
                "Verification Measure Data (Test Logs)",
                "Integration Sequence Instruction",
                "Problem/Defect Reports",
                "Integrated Software builds"
            ],
            "BP_rating_rules": {
                "F": [
                    "Software elements are integrated according to a defined sequence and preconditions.",
                    "The selected integration verification measures are performed at each integration step.",
                    "Results are recorded for all executed measures with a clear pass/fail status.",
                    "The recorded data is sufficient to understand the test execution.",
                    "Integration issues are documented in a defect tracking system."
                ],
                "L": [
                    "Integration follows the defined sequence, and selected tests are performed.",
                    "Results are recorded with pass/fail status, though supporting logs might occasionally lack detail.",
                    "The overall integration status is clear and reliable."
                ],
                "P": [
                    "Integration does not follow the defined sequence ('big bang' instead of incremental).",
                    "Only some of the selected tests are performed.",
                    "Results are not systematically recorded, or the pass/fail status is missing."
                ],
                "N": [
                    "No integration is performed, or it is done without any verification.",
                    "No integration test results are available."
                ]
            }
        },
        {
            "BP_ID": "SWE.5.BP5",
            "BP_title": "Perform software component verification",
            "BP_statement": "Perform the selected verification measures for verifying software component behavior. Record the verification results including pass/fail status and corresponding verification measure data.",
            "BP_key_obj": "To execute the planned component tests and record the results to provide evidence that each component behaves correctly before it is integrated.",
            "BP_user_docs_needed": [
                "Component Verification Results",
                "Verification Measure Data (Test Logs)",
                "Problem/Defect Reports"
            ],
            "BP_rating_rules": {
                "F": [
                    "The selected verification measures for software components have been performed.",
                    "Results are recorded for all executed measures with a clear pass/fail status.",
                    "The recorded data is sufficient to understand what was done and reproduce the result.",
                    "Deviations from expected results are documented."
                ],
                "L": [
                    "Verification has been performed for the vast majority of selected measures.",
                    "Results are recorded with pass/fail status, and the overall status of the components is clear."
                ],
                "P": [
                    "Component verification is only partially performed.",
                    "Results are not systematically recorded, or the pass/fail status is often missing.",
                    "It is difficult to determine the quality of the individual components."
                ],
                "N": [
                    "No verification of software components has been performed.",
                    "No component verification results are recorded."
                ]
            }
        },
        {
            "BP_ID": "SWE.5.BP6",
            "BP_title": "Ensure consistency and establish bidirectional traceability",
            "BP_statement": "Ensure consistency and establish bidirectional traceability between verification measures and the static and dynamic aspects of the software architecture and detailed design. Establish bidirectional traceability between verification results and verification measures.",
            "BP_key_obj": "To link integration and component tests to the architectural design they verify, and test results to the tests that were executed, ensuring architectural elements are tested and the origin of any failure is traceable.",
            "BP_user_docs_needed": [
                "Consistency Evidence (e.g., traceability matrix)",
                "Software Integration/Component Test Specification",
                "Software Architecture Document",
                "Software Detailed Design Document",
                "Verification Results"
            ],
            "BP_rating_rules": {
                "F": [
                    "Complete bidirectional traceability exists between verification measures and the software architecture/design.",
                    "Complete bidirectional traceability exists between verification results and the corresponding verification measures.",
                    "Consistency checks ensure tests are appropriate for the architecture.",
                    "Traceability is up-to-date and allows for easy assessment of architectural test coverage."
                ],
                "L": [
                    "Traceability is largely complete and consistent.",
                    "There may be a few minor gaps or outdated links, but the relationship between architecture, tests, and results is clear.",
                    "Architectural test coverage can be reliably assessed."
                ],
                "P": [
                    "Significant gaps exist in traceability (e.g., many architectural components have no linked tests).",
                    "Test results are not linked back to the test cases.",
                    "It is difficult to determine the test coverage of the software architecture."
                ],
                "N": [
                    "No traceability exists between architecture, tests, and results."
                ]
            }
        },
        {
            "BP_ID": "SWE.5.BP7",
            "BP_title": "Summarize and communicate results",
            "BP_statement": "Summarize the software component verification and the software integration verification results and communicate them to all affected parties.",
            "BP_key_obj": "To consolidate all component and integration test results into a clear summary report, enabling stakeholders to assess the quality and readiness of the integrated software.",
            "BP_user_docs_needed": [
                "Communication Evidence (e.g., summary report, email)",
                "Integration/Component Verification Summary Report",
                "Verification Results"
            ],
            "BP_rating_rules": {
                "F": [
                    "A summary of the component and integration verification results is created.",
                    "The summary provides a clear overview of the status, including coverage metrics, passed/failed tests, and open defects.",
                    "There is evidence that this summary has been communicated to all affected parties (e.g., SW qualification team, project management).",
                    "The summary enables stakeholders to judge readiness for the next stage (e.g., software verification)."
                ],
                "L": [
                    "A summary of results is created and communicated, providing a clear picture of the verification status.",
                    "The summary may lack some formal metrics but is still effective.",
                    "All key stakeholders are informed."
                ],
                "P": [
                    "Only raw test logs are communicated without any summary.",
                    "The summary is misleading, incomplete, or not communicated to all relevant parties.",
                    "It is not possible to get a clear picture of the integration status."
                ],
                "N": [
                    "No summary is created or communicated.",
                    "The status of software integration is unknown to other teams."
                ]
            }
        }
    ],
    "SWE.6":[
		{
            "BP_ID": "SWE.6.BP1",
            "BP_title": "Specify verification measures for software verification",
            "BP_statement": "Specify the verification measures for software verification suitable to provide evidence for compliance of the integrated software with the functional and non-functional information in the software requirements, including techniques for the verification measures, pass/fail criteria for verification measures, a definition of entry and exit criteria for the verification measures, necessary sequence of verification measures, and the required verification infrastructure and environment setup.",
            "BP_key_obj": "To develop a comprehensive test plan for the fully integrated software, ensuring that every software requirement is tested and that there are objective criteria for determining success.",
            "BP_user_docs_needed": [
                "Software Verification/Qualification Test Specification",
                "Software Requirements Specification (SRS)",
                "Test environment specification"
            ],
            "BP_rating_rules": {
                "F": [
                    "A software verification specification exists that is based on the software requirements.",
                    "It defines verification measures (test cases) for each requirement.",
                    "Clear and unambiguous pass/fail criteria are defined for each test case.",
                    "Entry/exit criteria for the overall verification campaign are defined.",
                    "The required verification infrastructure (e.g., HIL, test vehicle) and any necessary test sequence are specified."
                ],
                "L": [
                    "A verification specification exists and covers the vast majority of software requirements.",
                    "Pass/fail criteria are generally clear. Some entry/exit criteria may be implicit rather than formally documented.",
                    "The overall strategy is sound for validating the software against its requirements."
                ],
                "P": [
                    "The specification is incomplete, missing tests for significant functional or non-functional requirements.",
                    "Pass/fail criteria are frequently vague, subjective, or missing.",
                    "The specified tests are insufficient to provide confidence that the software meets its requirements."
                ],
                "N": [
                    "No software verification specification exists.",
                    "Testing is performed without a plan or predefined test cases based on requirements."
                ]
            }
        },
        {
            "BP_ID": "SWE.6.BP2",
            "BP_title": "Select verification measures",
            "BP_statement": "Document the selection of verification measures considering selection criteria including criteria for regression verification. The documented selection of verification measures shall have sufficient coverage according to the release scope.",
            "BP_key_obj": "To choose and justify the specific set of software tests to be executed for a given software release, ensuring that all requirements in scope are covered and that a defined regression strategy is in place.",
            "BP_user_docs_needed": [
                "Verification Measure Selection Set (e.g., Release Test Plan)",
                "Software Verification Test Specification",
                "Release Plan",
                "Software Requirements Specification"
            ],
            "BP_rating_rules": {
                "F": [
                    "The selection of verification measures for the current release is documented.",
                    "The selection provides sufficient coverage of the in-scope software requirements.",
                    "A clear strategy and criteria for regression testing are defined and applied based on changes to requirements.",
                    "The rationale for the selection is documented."
                ],
                "L": [
                    "A selection of verification measures is performed and documented.",
                    "Coverage of requirements is adequate for the release. The regression strategy is sound but may not be explicitly documented in detail.",
                    "The test scope is understood by the team."
                ],
                "P": [
                    "The selection of tests is not documented.",
                    "The regression strategy is ad-hoc.",
                    "The coverage of requirements is insufficient for the release, with known gaps."
                ],
                "N": [
                    "No selection of verification measures is performed.",
                    "It is unclear which requirements are tested for any given release."
                ]
            }
        },
        {
            "BP_ID": "SWE.6.BP3",
            "BP_title": "Verify the integrated software",
            "BP_statement": "Perform the verification of the integrated software using the selected verification measures. Record the verification results including pass/fail status and corresponding verification measure data.",
            "BP_key_obj": "To execute the planned software verification tests on the fully integrated software and to systematically capture the results to provide objective evidence of compliance with software requirements.",
            "BP_user_docs_needed": [
                "Software Verification Results / Test Report",
                "Verification Measure Data (Test Logs, screenshots, etc.)",
                "Problem/Defect Reports"
            ],
            "BP_rating_rules": {
                "F": [
                    "The selected verification measures have been performed on the integrated software.",
                    "Results are recorded for all executed tests.",
                    "Each result includes a clear pass/fail status.",
                    "The recorded data is sufficient to understand what was tested and reproduce the result.",
                    "Failures are documented in a defect tracking system, linked to the failed test."
                ],
                "L": [
                    "Verification has been performed for the vast majority of selected measures.",
                    "Results are recorded with pass/fail status, but the supporting data might occasionally lack some detail.",
                    "The overall compliance of the software with its requirements is clear."
                ],
                "P": [
                    "Verification is only partially performed.",
                    "Results are not systematically recorded, or the pass/fail status is often missing.",
                    "It is difficult to determine whether the software meets its requirements based on the available records."
                ],
                "N": [
                    "No verification of the integrated software has been performed.",
                    "No verification results are recorded."
                ]
            }
        },
        {
            "BP_ID": "SWE.6.BP4",
            "BP_title": "Ensure consistency and establish bidirectional traceability",
            "BP_statement": "Ensure consistency and establish bidirectional traceability between verification measures and software requirements. Establish bidirectional traceability between verification results and verification measures.",
            "BP_key_obj": "To link software tests to the requirements they verify, and test results to the tests that were executed, ensuring all requirements are tested and the status of each requirement's verification is known.",
            "BP_user_docs_needed": [
                "Consistency Evidence (e.g., traceability matrix, requirements coverage report)",
                "Software Verification Test Specification",
                "Software Requirements Specification",
                "Software Verification Results"
            ],
            "BP_rating_rules": {
                "F": [
                    "Complete bidirectional traceability exists between verification measures (test cases) and software requirements.",
                    "Complete bidirectional traceability exists between verification results and the corresponding verification measures.",
                    "The traceability is used to generate requirement coverage reports.",
                    "The traceability is up-to-date, and consistency checks ensure tests are appropriate for the requirements."
                ],
                "L": [
                    "Traceability is largely complete and consistent.",
                    "There may be a few minor gaps or outdated links for non-critical requirements, but the relationship between requirements, tests, and results is clear.",
                    "Requirement test coverage can be reliably assessed."
                ],
                "P": [
                    "Significant gaps exist in traceability; many requirements have no linked test cases.",
                    "Test results are not linked back to the test cases or requirements.",
                    "It is difficult to determine the test coverage of the software requirements."
                ],
                "N": [
                    "No traceability exists between requirements, tests, and results."
                ]
            }
        },
        {
            "BP_ID": "SWE.6.BP5",
            "BP_title": "Summarize and communicate results",
            "BP_statement": "Summarize the software verification results and communicate them to all affected parties.",
            "BP_key_obj": "To consolidate the detailed test results into a final software qualification report that enables a formal release decision by stakeholders (e.g., system integration, project management, customer).",
            "BP_user_docs_needed": [
                "Communication Evidence (e.g., release notice with summary attached)",
                "Software Verification Summary Report / Qualification Report",
                "Verification Results"
            ],
            "BP_rating_rules": {
                "F": [
                    "A summary of the software verification results (e.g., a Qualification Report) is created.",
                    "The summary provides a clear overview of the status, including requirements coverage, passed/failed tests, open defects, and any deviations.",
                    "The summary provides a recommendation on the software's readiness for release.",
                    "There is evidence that this summary has been communicated to all affected parties for approval."
                ],
                "L": [
                    "A summary of results is created and communicated, providing a clear picture of the software's status against requirements.",
                    "The summary may lack a formal recommendation but contains all the necessary data for a release decision.",
                    "All key stakeholders are informed."
                ],
                "P": [
                    "Only raw test logs are communicated without a summary.",
                    "The summary is misleading, incomplete, or fails to report on the status of all requirements.",
                    "It is not possible to make an informed release decision based on the information provided."
                ],
                "N": [
                    "No summary is created or communicated.",
                    "The final status of the software is unknown to project stakeholders."
                ]
            }
        }
    ],
	"CapabilityLevel": {
        "1": {
            "PA_name": "Performed process",
            "PA_ID": "PA 1.1",
            "GenericPractices": [
                {
                    "GP_ID": "GP 1.1.1",
                    "GP_title": "Achieve the process outcomes",
                    "GP_statement": "Achieve the intent of the base practices. Produce work products that evidence the process outcomes.",
                    "GP_key_obj": "Execute the process, Achieve the process purpose, Create required outputs",
                    "GP_user_docs_needed": "All process-specific information items as defined for the Base Practices",
                    "GP_rating_rules": {
                            "N": [
                                "There is little or no evidence of achieving the process purpose.",
                                "The base practices are not performed.",
                                "Required work products are missing or add no value."
                            ],
                            "P": [
                                "There is some evidence of achieving the process purpose, but it is ad-hoc and unpredictable.",
                                "Some base practices are attempted, but with significant weaknesses.",
                                "Work products are incomplete or of poor quality."
                            ],
                            "L": [
                                "There is evidence of a systematic approach to achieving the process purpose.",
                                "Most base practices are performed effectively, but some weaknesses may exist.",
                                "The process largely achieves its outcomes."
                            ],
                            "F": [
                                "There is evidence of a complete and systematic achievement of the process purpose.",
                                "All base practices are performed effectively.",
                                "Work products provide full evidence of the process outcomes being met."
                            ]
                        }
                }
            ]
        },
        "2": {
            "PA_name": "Managed process",
            "PA_ID": "PA 2.1 and PA 2.2",
            "GenericPractices": [
                {
                    "GP_ID": "GP 2.1.1",
                    "GP_title": "Identify the objectives and define a strategy for the performance of the process.",
                    "GP_statement": "The scope of the process activities including the management of process performance and the management of work products are determined. Corresponding results to be achieved are determined. Process performance objectives and associated criteria are identified. Assumptions and constraints are considered when identifying the performance objectives. Approach and methodology for the process performance is determined.",
                    "GP_key_obj": "Define success for the process, Set clear targets, Establish a consistent approach, Plan for management",
                    "GP_user_docs_needed": "Process Performance Strategy, Process Performance Objectives",
                    "GP_rating_rules": {
                            "N": [
                                "No objectives or strategy are defined for the process.",
                                "Work is purely reactive."
                            ],
                            "P": [
                                "Vague objectives exist (e.g., 'test the software'), but no concrete, measurable criteria or strategy are documented.",
                                "The approach is not defined."
                            ],
                            "L": [
                                "A strategy and clear objectives are defined for the process performance.",
                                "They might not fully cover all aspects (e.g., work product management) or might lack detail on assumptions."
                            ],
                            "F": [
                                "A clear strategy and specific, measurable performance objectives (e.g., delivery dates, quality targets, test coverage) are defined, documented, and understood for the process. Assumptions and constraints are considered."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 2.1.2",
                    "GP_title": "Plan the performance of the process.",
                    "GP_statement": "The planning for the performance of the process is established according to the defined objectives, criteria, and strategy. Process activities and work packages are defined. Estimates for work packages are identified using appropriate methods.",
                    "GP_key_obj": "Create an actionable plan, Break down work, Estimate effort, Define a schedule",
                    "GP_user_docs_needed": "Work Package, Schedule",
                    "GP_rating_rules": {
                            "N": [
                                "No plan exists for the process."
                            ],
                            "P": [
                                "A plan exists but it is high-level, lacks detail on work packages, or has no realistic estimates.",
                                "The plan is not based on the defined objectives."
                            ],
                            "L": [
                                "The process is planned with defined work packages and estimates.",
                                "The plan is generally followed, but estimates might be based on weak methods or not consistently updated."
                            ],
                            "F": [
                                "Detailed planning for the process is established and maintained, including defined work packages, effort estimates based on appropriate methods, and a defined schedule with milestones."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 2.1.3",
                    "GP_title": "Determine resource needs.",
                    "GP_statement": "The required amount of human resources, and experience, knowledge and skill needs for the for process performance are determined based on the planning. The needs for physical and material resources are determined based on the planning. Required responsibilities and authorities to perform the process, and to manage the corresponding work products are determined.",
                    "GP_key_obj": "Identify necessary skills and people, Identify required tools and infrastructure, Define roles and responsibilities",
                    "GP_user_docs_needed": "Resource Needs",
                    "GP_rating_rules": {
                            "N": [
                                "Resource needs are not determined.",
                                "It is assumed the right people and tools are available."
                            ],
                            "P": [
                                "Some resource needs are identified, but the analysis is incomplete.",
                                "Skill requirements are not defined, or responsibilities are unclear."
                            ],
                            "L": [
                                "Human and physical resource needs are determined based on the plan.",
                                "Responsibilities are defined but may have some ambiguities or overlaps."
                            ],
                            "F": [
                                "All required resources (human with specific skills, physical, material) are systematically determined based on the process plan. Responsibilities and authorities for all process roles are clearly defined."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 2.1.4",
                    "GP_title": "Identify and make available resources.",
                    "GP_statement": "The individuals performing and managing the process are identified and allocated according to the determined needs. The individuals performing and managing the process are being qualified to execute their responsibilities. The other resources, necessary for performing the process are identified, made available, allocated and used according to the determined needs.",
                    "GP_key_obj": "Staff the process with qualified people, Provide necessary tools and equipment, Ensure resource availability",
                    "GP_user_docs_needed": "Resource Allocation",
                    "GP_rating_rules": {
                            "N": [
                                "Resources are not formally allocated.",
                                "Team members are not qualified for their tasks."
                            ],
                            "P": [
                                "Resources are allocated, but they may not match the determined needs (e.g., wrong skills, insufficient tools).",
                                "Qualification is not ensured."
                            ],
                            "L": [
                                "The necessary resources are identified and made available.",
                                "There may be some delays in availability or minor gaps in qualification that are being addressed."
                            ],
                            "F": [
                                "Individuals are allocated to the process according to the determined needs, and their qualification is ensured (e.g., through training). All other necessary resources are identified, made available, and allocated for use."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 2.1.5",
                    "GP_title": "Monitor and adjust the performance of the process.",
                    "GP_statement": "Process performance is monitored to identify deviations from the planning. Appropriate actions in case of deviations from the planning are taken. The planning is adjusted as necessary.",
                    "GP_key_obj": "Track progress against the plan, Identify and react to deviations, Keep the plan realistic",
                    "GP_user_docs_needed": "Progress Status, Schedule",
                    "GP_rating_rules": {
                            "N": [
                                "Performance is not monitored.",
                                "The plan, if it exists, is never looked at again."
                            ],
                            "P": [
                                "Monitoring is ad-hoc or informal.",
                                "Deviations are identified late, and actions are reactive and often ineffective. The plan is not adjusted."
                            ],
                            "L": [
                                "Process performance is regularly monitored against the plan, and deviations are identified.",
                                "Actions are taken to address them, though adjustments to the plan may sometimes be delayed."
                            ],
                            "F": [
                                "Process performance is systematically monitored against the plan, deviations are identified, appropriate corrective actions are taken, and the plan is adjusted as necessary to meet the objectives."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 2.1.6",
                    "GP_title": "Manage the interfaces between involved parties.",
                    "GP_statement": "The individuals and groups including required external parties involved in the process performance are determined. Responsibilities are assigned to the relevant individuals or parties. Communication mechanisms between the involved parties are determined. Effective communication between the involved parties is established and maintained.",
                    "GP_key_obj": "Ensure clear communication, Manage dependencies, Assign interface responsibilities",
                    "GP_user_docs_needed": "Communication Matrix, Communication Evidence",
                    "GP_rating_rules": {
                            "N": [
                                "Interfaces are not managed.",
                                "Communication between involved parties is poor or non-existent."
                            ],
                            "P": [
                                "Involved parties are known, but responsibilities at the interfaces are unclear.",
                                "Communication is informal and often leads to misunderstandings."
                            ],
                            "L": [
                                "Interfaces and responsibilities are determined and communication mechanisms are defined.",
                                "Communication is mostly effective, but occasional breakdowns or ambiguities may occur."
                            ],
                            "F": [
                                "All internal and external parties involved in the process are identified, interface responsibilities are assigned, and effective communication mechanisms are established and maintained."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 2.2.1",
                    "GP_title": "Define the requirements for the work products.",
                    "GP_statement": "The requirements for the content and structure of the work products to be produced are defined. Quality criteria for the work products are identified. Appropriate review and approval criteria for the work products are defined.",
                    "GP_key_obj": "Ensure work product quality and consistency, Define content and structure standards, Establish review and approval gates",
                    "GP_user_docs_needed": "Requirements for work products, Review and approval criteria for work products, Quality criteria",
                    "GP_rating_rules": {
                            "N": [
                                "There are no defined requirements for work products.",
                                "Quality is based on individual preference."
                            ],
                            "P": [
                                "Some requirements for work products exist (e.g., a template), but quality, review, and approval criteria are not defined."
                            ],
                            "L": [
                                "Requirements for the content and structure of work products are defined.",
                                "Quality and review/approval criteria are defined but may be generic or not consistently applied."
                            ],
                            "F": [
                                "Clear and specific requirements for the content and structure of work products are defined, along with measurable quality criteria and formal review and approval criteria."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 2.2.2",
                    "GP_title": "Define the requirements for storage and control of the work products.",
                    "GP_statement": "Requirements for the storage and control of the work products are defined, including their identification and distribution.",
                    "GP_key_obj": "Establish configuration management rules, Ensure data integrity and availability, Define access and version control",
                    "GP_user_docs_needed": "Requirements for work products",
                    "GP_rating_rules": {
                            "N": [
                                "There are no defined requirements for how work products should be stored or controlled."
                            ],
                            "P": [
                                "General guidelines exist (e.g., 'use the shared drive'), but specific requirements for identification, versioning, and access control are missing."
                            ],
                            "L": [
                                "Requirements for storage and control are defined, but may lack detail in areas like distribution or specific versioning rules."
                            ],
                            "F": [
                                "Clear requirements for the storage, identification, access control, versioning, and distribution of all work products are defined and documented."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 2.2.3",
                    "GP_title": "Identify, store and control the work products.",
                    "GP_statement": "The work products to be controlled are identified. The work products are stored and controlled in accordance with the requirements. Change control is established for work products. Versioning and baselining of the work products is performed in accordance with the requirements for storage and control of the work products. The work products including the revision status are made available through appropriate mechanisms.",
                    "GP_key_obj": "Implement configuration management, Maintain version history, Establish baselines, Control changes",
                    "GP_user_docs_needed": "Repository, Baseline",
                    "GP_rating_rules": {
                            "N": [
                                "Work products are stored on local machines with no control.",
                                "There is no versioning or change control."
                            ],
                            "P": [
                                "Work products are stored in a central repository, but control is weak.",
                                "Versioning is inconsistent, baselines are not used, and changes are not formally controlled."
                            ],
                            "L": [
                                "Work products are identified, stored, and controlled.",
                                "Versioning is used, and baselines are created, but the change control process for baselined items might be informal or not always followed."
                            ],
                            "F": [
                                "All work products are identified and stored in a controlled repository. Change control, versioning, and baselining are performed systematically in accordance with defined requirements. The status of all items is clear and available."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 2.2.4",
                    "GP_title": "Review and adjust work products.",
                    "GP_statement": "The work products are reviewed against the defined requirements and criteria. Resolution of issues arising from work products reviews is ensured.",
                    "GP_key_obj": "Verify work product quality, Ensure requirements are met, Resolve defects and issues",
                    "GP_user_docs_needed": "Review evidence",
                    "GP_rating_rules": {
                            "N": [
                                "Work products are not reviewed.",
                                "They are used 'as-is'."
                            ],
                            "P": [
                                "Reviews are conducted, but they are informal and not based on defined criteria.",
                                "Issues are identified but not tracked to resolution."
                            ],
                            "L": [
                                "Work products are reviewed against defined criteria, and issues are recorded.",
                                "The process for ensuring resolution of all issues may have weaknesses or delays."
                            ],
                            "F": [
                                "All work products are formally reviewed against their defined requirements and quality criteria. All issues identified during reviews are documented, tracked, and driven to resolution."
                            ]
                        }
                }
            ]
        },
        "3": {
            "PA_name": "Established process",
            "PA_ID": "PA 3.1 and PA 3.2",
            "GenericPractices": [
                {
                    "GP_ID": "GP 3.1.1",
                    "GP_title": "Establish and maintain the standard process.",
                    "GP_statement": "A suitable standard process is developed including required activities and their interactions. Inputs and outputs of the standard process are defined including the corresponding entry and exit criteria to determine the interactions and sequence with other processes. Process performance roles are identified and assigned to the standard process activities including their type of involvement, responsibilities, and authorities. Suitable guidance, procedures, and templates are provided to support the execution of the process as needed. Appropriate tailoring guidelines including predefined unambiguous criteria as well as predefined and unambiguous proceedings are defined based on identified deployment needs and context of the standard process. The standard process is maintained according to corresponding feedback from the monitoring of the deployed processes.",
                    "GP_key_obj": "Define a repeatable organizational process, Provide standard assets (templates, guidelines), Allow for controlled tailoring, Continuously improve the standard",
                    "GP_user_docs_needed": "Process Description, Tailoring Guideline",
                    "GP_rating_rules": {
                            "N": [
                                "No standard process exists for the organization.",
                                "Each project reinvents the process from scratch."
                            ],
                            "P": [
                                "A standard process is documented but is of poor quality, incomplete, or not maintained.",
                                "Tailoring guidelines are missing or ambiguous, leading to inconsistent deployment."
                            ],
                            "L": [
                                "A standard process is developed and maintained, including roles, activities, and assets.",
                                "Tailoring guidelines exist but may lack the necessary detail, or the process for incorporating feedback is informal."
                            ],
                            "F": [
                                "A complete standard process is developed, established, and maintained, including activities, roles, entry/exit criteria, supporting assets (templates, guidance), and clear tailoring guidelines. The process is updated based on feedback."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 3.1.2",
                    "GP_title": "Determine the required competencies.",
                    "GP_statement": "Required competencies, skills, and experience for performing the standard process are determined for the identified roles. Appropriate qualification methods to acquire the necessary competencies and skills are determined, maintained, and made available for the identified roles.",
                    "GP_key_obj": "Define skill requirements for process roles, Establish training and qualification paths, Ensure organizational capability",
                    "GP_user_docs_needed": "Role Description, Qualification method description",
                    "GP_rating_rules": {
                            "N": [
                                "Competency requirements are not considered for process roles."
                            ],
                            "P": [
                                "Competencies are vaguely described for roles.",
                                "No specific qualification methods (e.g., training courses) are defined or made available."
                            ],
                            "L": [
                                "Required competencies are determined for the standard process roles, and some qualification methods are available.",
                                "The link between roles, competencies, and available training may not be fully systematic."
                            ],
                            "F": [
                                "The competencies, skills, and experience required for the roles in the standard process are clearly determined. Appropriate qualification methods are defined, maintained, and made available to develop these competencies."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 3.1.3",
                    "GP_title": "Determine the required resources.",
                    "GP_statement": "Required physical and material resources and process infrastructure needs for performing the standard process are determined.",
                    "GP_key_obj": "Identify standard tools and infrastructure, Plan for resource needs at an organizational level, Ensure process support",
                    "GP_user_docs_needed": "Process resource and infrastructure description",
                    "GP_rating_rules": {
                            "N": [
                                "Resource and infrastructure needs are not determined at the organizational level."
                            ],
                            "P": [
                                "Some standard tools are mentioned, but a systematic determination of all infrastructure needs for the standard process is missing."
                            ],
                            "L": [
                                "The key resources and infrastructure needed to perform the standard process are determined.",
                                "The list may be incomplete or not regularly updated."
                            ],
                            "F": [
                                "The required physical resources, tools, and process infrastructure needed to support the standard process are systematically determined and documented as part of the standard process definition."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 3.1.4",
                    "GP_title": "Determine suitable methods to monitor the standard process.",
                    "GP_statement": "Methods and required activities for monitoring the effectiveness and adequacy of the standard process are determined. Appropriate criteria and information needed to monitor the standard process are defined.",
                    "GP_key_obj": "Plan for process performance measurement, Define metrics for process effectiveness, Establish a feedback loop for improvement",
                    "GP_user_docs_needed": "Process monitoring method",
                    "GP_rating_rules": {
                            "N": [
                                "There is no plan to monitor the standard process."
                            ],
                            "P": [
                                "The idea of monitoring exists, but no concrete methods or criteria are defined.",
                                "Data gathering is ad-hoc."
                            ],
                            "L": [
                                "Methods for monitoring the standard process are determined, but the criteria may be qualitative and subjective, or the information gathered may not be systematically analyzed."
                            ],
                            "F": [
                                "Suitable methods (e.g., process compliance checks, audits, lessons learned) and clear criteria for monitoring the effectiveness, suitability, and adequacy of the standard process are determined and defined."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 3.2.1",
                    "GP_title": "Deploy a defined process that satisfies the context specific requirements of the use of the standard process.",
                    "GP_statement": "The defined process is appropriately selected and/or tailored from the standard process. Conformance of defined process with standard process requirements and tailoring criteria is verified. The defined process is used as managed process to achieve the process outcomes.",
                    "GP_key_obj": "Adapt the standard process for project use, Follow tailoring rules, Ensure compliance with organizational standards",
                    "GP_user_docs_needed": "Process description, Tailoring documentation",
                    "GP_rating_rules": {
                            "N": [
                                "Projects do not use the standard process.",
                                "They create their own process or have no defined process."
                            ],
                            "P": [
                                "The standard process is used as a reference, but tailoring is done without following the guidelines, or conformance is not verified.",
                                "The resulting defined process has significant deviations."
                            ],
                            "L": [
                                "A defined process is deployed by tailoring the standard process according to the guidelines.",
                                "There might be minor, undocumented deviations or a lack of formal verification of conformance."
                            ],
                            "F": [
                                "A defined process is deployed for the project by selecting and tailoring the standard process according to the defined tailoring guidelines, and its conformance is verified."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 3.2.2",
                    "GP_title": "Ensure required competencies for the defined roles.",
                    "GP_statement": "Human resources are allocated to the defined roles according to the required competencies and skills. Assignment of persons to roles and corresponding responsibilities and authorities for performing the defined process are communicated. Gaps in competencies and skills are identified, and corresponding qualification measures are initiated and monitored.",
                    "GP_key_obj": "Staff projects with competent people, Communicate roles clearly, Identify and close skill gaps",
                    "GP_user_docs_needed": "Role assignment",
                    "GP_rating_rules": {
                            "N": [
                                "People are assigned to roles without considering their competencies.",
                                "Skill gaps are not addressed."
                            ],
                            "P": [
                                "People are assigned to roles, but a formal check against required competencies is not done.",
                                "Skill gaps are identified but no action is taken to close them."
                            ],
                            "L": [
                                "Human resources are allocated based on competency requirements.",
                                "Skill gaps are identified and qualification measures are initiated, but the monitoring of their effectiveness might be weak."
                            ],
                            "F": [
                                "People are allocated to the roles of the defined process based on a systematic check of their competencies. Any identified skill gaps are addressed through initiated and monitored qualification measures."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 3.2.3",
                    "GP_title": "Ensure required resources to support the performance of the defined process.",
                    "GP_statement": "Required information to perform the defined process is made available, allocated and used. Required physical and material resources, process infrastructure and work environment are made available, allocated and used. Availability and usage of resources are measured and monitored.",
                    "GP_key_obj": "Provide necessary tools and environment for the project, Ensure information is available, Monitor resource usage",
                    "GP_user_docs_needed": "Process resource and infrastructure documentation",
                    "GP_rating_rules": {
                            "N": [
                                "The project lacks the necessary resources (tools, infrastructure) to perform the defined process."
                            ],
                            "P": [
                                "Some required resources are provided, but there are significant gaps, or their availability is not monitored.",
                                "This impedes the performance of the process."
                            ],
                            "L": [
                                "The required resources and information are made available and allocated.",
                                "Monitoring of availability and usage is informal or inconsistent."
                            ],
                            "F": [
                                "All required resources (information, tools, infrastructure, work environment) as specified by the defined process are made available, allocated, and used. Their availability and usage are monitored."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 3.2.4",
                    "GP_title": "Monitor the performance of the defined process.",
                    "GP_statement": "Information is collected and analyzed according to the determined process monitoring methods to understand the effectiveness and adequacy of the defined process. Results of the analysis are made available to all effected parties and used to identify where continual improvement of the standard and/or defined process can be made.",
                    "GP_key_obj": "Collect data on process performance, Analyze data to understand effectiveness, Provide feedback for process improvement",
                    "GP_user_docs_needed": "Process performance information",
                    "GP_rating_rules": {
                            "N": [
                                "No information about the performance of the defined process is collected."
                            ],
                            "P": [
                                "Some data is collected, but it is not analyzed, or the results are not used to provide feedback for improvement."
                            ],
                            "L": [
                                "Information on process performance is collected and analyzed according to the standard monitoring methods.",
                                "The results are made available, but the process for feeding this back into the improvement of the standard process is informal."
                            ],
                            "F": [
                                "Information about the performance of the defined process is collected and analyzed according to the standard methods. The results are used to understand process effectiveness and provide documented feedback for the continual improvement of the standard process."
                            ]
                        }
                }
            ]
        },
        "4": {
            "PA_name": "Predictable process",
            "PA_ID": "PA 4.1 and PA 4.2",
            "GenericPractices": [
                {
                    "GP_ID": "GP 4.1.1",
                    "GP_title": "Identify business goals.",
                    "GP_statement": "Business goals are identified that are supported by the quantitatively measured process.",
                    "GP_key_obj": "Link process performance to business outcomes, Justify quantitative management, Define top-level objectives",
                    "GP_user_docs_needed": "Business goals",
                    "GP_rating_rules": {
                            "N": [
                                "No business goals are identified in relation to the process."
                            ],
                            "P": [
                                "Business goals are stated at a very high level (e.g., 'increase profit') but are not linked to the performance of the process being measured."
                            ],
                            "L": [
                                "Relevant business goals are identified, but their connection to the process performance might be qualitative or not clearly defined."
                            ],
                            "F": [
                                "Specific, relevant business goals (e.g., 'reduce warranty costs by 10%') are identified that are directly supported by the quantitative management of the process."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 4.1.2",
                    "GP_title": "Establish process information needs.",
                    "GP_statement": "Stakeholders of the identified business goals and the quantitatively measured process are identified, and their information needs are defined and agreed.",
                    "GP_key_obj": "Determine what information stakeholders need, Translate business goals into information requirements, Align on measurement scope",
                    "GP_user_docs_needed": "Business goals",
                    "GP_rating_rules": {
                            "N": [
                                "Information needs are not defined."
                            ],
                            "P": [
                                "Information needs are defined but are not linked to the business goals or agreed with stakeholders.",
                                "This leads to collecting irrelevant data."
                            ],
                            "L": [
                                "Information needs are defined based on business goals and agreed with key stakeholders.",
                                "They might lack the detail needed to derive precise metrics."
                            ],
                            "F": [
                                "The information needs of relevant stakeholders are clearly defined and agreed upon as a direct result of analyzing the identified business goals."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 4.1.3",
                    "GP_title": "Identify measurable relationships between process elements.",
                    "GP_statement": "Identify the relationships between process elements, or sets of process elements, which contribute to the process information needs.",
                    "GP_key_obj": "Build a model of process performance, Understand cause-and-effect relationships, Identify what to measure",
                    "GP_user_docs_needed": "Quantitative process metric",
                    "GP_rating_rules": {
                            "N": [
                                "No attempt is made to understand how process elements relate to performance."
                            ],
                            "P": [
                                "Some relationships are assumed but are not based on analysis or data.",
                                "The model is informal or incorrect."
                            ],
                            "L": [
                                "Key relationships between process elements (e.g., review effort and defect density) are identified to address the information needs.",
                                "The model may be simplistic."
                            ],
                            "F": [
                                "A model of process performance is developed by identifying the measurable relationships between process elements (activities, work products) that contribute to achieving the information needs."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 4.1.4",
                    "GP_title": "Derive process measurement approach and select analysis techniques.",
                    "GP_statement": "Based on the measurable relationships of process elements, or set of process elements, the process measurement metrics are derived to satisfy the established process information needs. Frequency of data collection is defined. Select analysis techniques, appropriate to collected data. Algorithms and methods to create derived measurement results from base measures are defined, as appropriate. Verification mechanism for base and derived measures is defined.",
                    "GP_key_obj": "Define specific metrics, Plan data collection, Choose appropriate statistical methods, Ensure data quality",
                    "GP_user_docs_needed": "Quantitative process metric, Process analysis techniques",
                    "GP_rating_rules": {
                            "N": [
                                "No metrics or analysis techniques are defined."
                            ],
                            "P": [
                                "Metrics are defined but do not align with the information needs.",
                                "Data collection frequency is not defined, and analysis techniques are inappropriate for the data type."
                            ],
                            "L": [
                                "Appropriate metrics, collection frequencies, and analysis techniques are defined.",
                                "The definition of derived metrics or data verification mechanisms may be weak."
                            ],
                            "F": [
                                "A comprehensive measurement approach is derived, defining specific metrics, data collection frequency, analysis techniques (e.g., control charts), algorithms for derived measures, and data verification mechanisms."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 4.1.5",
                    "GP_title": "Establish quantitative control limits.",
                    "GP_statement": "Establish quantitative control limits for the derived metrics. Agreement with process stakeholders is established.",
                    "GP_key_obj": "Define the range of expected performance, Differentiate between normal and special cause variation, Set thresholds for action",
                    "GP_user_docs_needed": "Process control limits",
                    "GP_rating_rules": {
                            "N": [
                                "No control limits are established."
                            ],
                            "P": [
                                "Control limits are set arbitrarily without being based on historical data or statistical analysis.",
                                "They are not agreed with stakeholders."
                            ],
                            "L": [
                                "Control limits are established for the key metrics, but they may be based on limited data or not be statistically robust."
                            ],
                            "F": [
                                "Quantitative control limits for the defined metrics are established using statistical analysis of historical performance data and are agreed with the relevant process stakeholders."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 4.1.6",
                    "GP_title": "Collect product and process measurement results through performing the defined process.",
                    "GP_statement": "Data collection mechanisms are created for all identified metrics. Required data is collected across process instances of within the defined frequency and recorded. Measurement results are analyzed and reported to the identified stakeholders.",
                    "GP_key_obj": "Execute the measurement plan, Gather and validate data, Analyze and report results",
                    "GP_user_docs_needed": "Process measurement data",
                    "GP_rating_rules": {
                            "N": [
                                "Data is not collected."
                            ],
                            "P": [
                                "Data collection is inconsistent, incomplete, or not done at the defined frequency.",
                                "Analysis and reporting do not occur."
                            ],
                            "L": [
                                "Data is collected and recorded for the defined metrics.",
                                "Analysis and reporting are performed, but may be delayed or not reach all identified stakeholders."
                            ],
                            "F": [
                                "Data for all identified metrics is systematically collected from process instances at the defined frequency using established mechanisms. The data is validated, analyzed, and the results are reported to stakeholders."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 4.2.1",
                    "GP_title": "Identify variations in process performance.",
                    "GP_statement": "Deviations in the performance of process instances from the established quantitative control limits are determined based on the collected quantitative measurement data.",
                    "GP_key_obj": "Monitor process stability, Detect outliers and deviations, Use control limits to identify special causes",
                    "GP_user_docs_needed": "Quantitative process analysis results",
                    "GP_rating_rules": {
                            "N": [
                                "Collected data is not compared against control limits."
                            ],
                            "P": [
                                "Data is compared to limits, but the identification of variations is not systematic, and special causes are not distinguished from common causes."
                            ],
                            "L": [
                                "Deviations from control limits are determined from the collected data, identifying most instances of special cause variation."
                            ],
                            "F": [
                                "The collected quantitative data is continuously analyzed to determine any deviations of process performance from the established quantitative control limits (i.e., identifying special causes of variation)."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 4.2.2",
                    "GP_title": "Identify causes of variation.",
                    "GP_statement": "The determined deviations in process performance are analyzed to identify potential cause(s) of variation using the defined analysis techniques. Distributions are used to quantitatively understand the variation of process performance under the influence of potential causes of variation. Consequences of process variation are analyzed.",
                    "GP_key_obj": "Perform root cause analysis on deviations, Understand the impact of special causes, Use statistical analysis to find causes",
                    "GP_user_docs_needed": "Quantitative process analysis results",
                    "GP_rating_rules": {
                            "N": [
                                "No analysis is done to understand the causes of variation."
                            ],
                            "P": [
                                "Causes are guessed at without a structured analysis.",
                                "The consequences are not understood."
                            ],
                            "L": [
                                "Deviations are analyzed to identify their likely causes.",
                                "The analysis may be more qualitative than quantitative, and the use of statistical techniques is limited."
                            ],
                            "F": [
                                "The identified special causes of variation are analyzed using appropriate techniques (e.g., root cause analysis, statistical analysis) to determine their cause and quantitatively understand their consequences."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 4.2.3",
                    "GP_title": "Identify and implement corrective actions to address assignable causes.",
                    "GP_statement": "Results are provided to those responsible for taking action. Corrective actions are determined and implemented to address each assignable cause of variation. Corrective action results are monitored and evaluated to determine their effectiveness.",
                    "GP_key_obj": "Eliminate special causes of variation, Stabilize the process, Verify the effectiveness of actions",
                    "GP_user_docs_needed": "Measures against deviations in quantitative process analysis, Quantitative process analysis results",
                    "GP_rating_rules": {
                            "N": [
                                "No corrective actions are taken to address assignable causes."
                            ],
                            "P": [
                                "Corrective actions are identified but not implemented, or their effectiveness is not monitored."
                            ],
                            "L": [
                                "Corrective actions are determined and implemented for most assignable causes.",
                                "The evaluation of their effectiveness might be informal."
                            ],
                            "F": [
                                "Corrective actions are determined and implemented to address each identified assignable cause of variation. The results of these actions are monitored and evaluated to confirm their effectiveness in stabilizing the process."
                            ]
                        }
                }
            ]
        },
        "5": {
            "PA_name": "Innovating process",
            "PA_ID": "PA 5.1 and PA 5.2",
            "GenericPractices": [
                {
                    "GP_ID": "GP 5.1.1",
                    "GP_title": "Define the process innovation objectives for the process that support the relevant business goals.",
                    "GP_statement": "New business visions and goals are analyzed to give guidance for new process objectives and potential areas of process innovation. Quantitative and qualitative process innovation objectives are defined and documented.",
                    "GP_key_obj": "Set goals for breakthrough improvements, Align innovation with business strategy, Look beyond stabilization",
                    "GP_user_docs_needed": "Improvement opportunity",
                    "GP_rating_rules": {
                            "N": [
                                "There are no objectives for process innovation."
                            ],
                            "P": [
                                "Vague innovation goals exist (e.g., 'be more efficient') but are not linked to business goals or defined in measurable terms."
                            ],
                            "L": [
                                "Process innovation objectives are defined and support business goals, but they may be more qualitative than quantitative."
                            ],
                            "F": [
                                "Clear quantitative and qualitative process innovation objectives are defined and documented, derived from an analysis of new business visions and goals."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 5.1.2",
                    "GP_title": "Analyze quantitative data of the process.",
                    "GP_statement": "Common causes of variation in process performance across process instances are identified and analyzed to get a quantitative understanding of their impact.",
                    "GP_key_obj": "Understand inherent process limitations, Analyze common cause variation, Identify opportunities to shift the mean",
                    "GP_user_docs_needed": "Common cause of variation analysis results",
                    "GP_rating_rules": {
                            "N": [
                                "Quantitative data is not analyzed for common causes of variation."
                            ],
                            "P": [
                                "Analysis is performed, but fails to distinguish common cause from special cause variation, or does not quantify the impact."
                            ],
                            "L": [
                                "Common causes of variation are identified and analyzed.",
                                "The quantitative understanding of their impact may be limited."
                            ],
                            "F": [
                                "The predictable performance of the process is analyzed to identify and quantitatively understand the impact of the common causes of variation."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 5.1.3",
                    "GP_title": "Identify innovation opportunities.",
                    "GP_statement": "Identify opportunities for innovation based on the quantitative understanding of the analyzed data. Industry best practices, new technologies and process concepts are identified and evaluated. Feedback on opportunities for innovation is actively sought. Emergent risks are considered in evaluating improvement opportunities.",
                    "GP_key_obj": "Seek breakthrough changes, Investigate new technologies and methods, Go beyond incremental improvement",
                    "GP_user_docs_needed": "Improvement opportunity",
                    "GP_rating_rules": {
                            "N": [
                                "No innovation opportunities are sought or identified."
                            ],
                            "P": [
                                "Innovation is considered, but the identification of opportunities is ad-hoc and not based on data analysis or investigation of new technologies."
                            ],
                            "L": [
                                "Opportunities for innovation are identified based on data analysis and some investigation of new concepts.",
                                "The process may not be systematic."
                            ],
                            "F": [
                                "Opportunities for process innovation are systematically identified based on quantitative analysis of common cause variation, evaluation of new technologies and best practices, and active solicitation of feedback."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 5.2.1",
                    "GP_title": "Define and assess the impact of proposed changes.",
                    "GP_statement": "Specified changes are assessed against product quality and process performance requirements and goals. Impact of changes to other defined and standard processes is considered. Objective priorities for process innovation are established. Commitment to innovation is demonstrated by organizational management including other relevant stakeholders.",
                    "GP_key_obj": "Evaluate potential innovations, Analyze impact on quality and performance, Secure management commitment",
                    "GP_user_docs_needed": "Improvement evaluation results",
                    "GP_rating_rules": {
                            "N": [
                                "Proposed changes are not assessed before implementation."
                            ],
                            "P": [
                                "Changes are assessed, but the impact analysis is superficial, and management commitment is not secured."
                            ],
                            "L": [
                                "Proposed innovations are assessed against performance goals, and priorities are established.",
                                "The impact analysis on other processes might be incomplete."
                            ],
                            "F": [
                                "All proposed process innovations are thoroughly assessed for their impact on quality and performance goals, as well as their impact on other processes. Priorities are set objectively, and management commitment is secured."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 5.2.2",
                    "GP_title": "Implement agreed process changes.",
                    "GP_statement": "A mechanism is established for incorporating accepted changes into the defined and standard process(es) effectively and completely. Process changes are implemented and effectively communicated to all affected parties.",
                    "GP_key_obj": "Deploy innovations organization-wide, Update standard processes, Manage the rollout of changes",
                    "GP_user_docs_needed": "Measures against deviations in quantitative process analysis",
                    "GP_rating_rules": {
                            "N": [
                                "Agreed changes are not implemented."
                            ],
                            "P": [
                                "Implementation is attempted but is incomplete or ineffective.",
                                "Changes are not incorporated into the standard process, and communication is poor."
                            ],
                            "L": [
                                "A mechanism for implementation exists, and agreed changes are deployed.",
                                "The incorporation into the standard process or communication to all parties may have some weaknesses."
                            ],
                            "F": [
                                "A mechanism is used to effectively and completely incorporate agreed innovations into the standard process(es). The changes are implemented and communicated to all affected parties."
                            ]
                        }
                },
                {
                    "GP_ID": "GP 5.2.3",
                    "GP_title": "Evaluate the effectiveness of process change.",
                    "GP_statement": "Performance and capability of the changed process are measured and compared with historical data. Performance and capability of the changed process are analyzed to determine whether the process performance has improved with respect to common causes of variations. Other feedback is recorded, such as opportunities for further innovation of the standard process. A mechanism is available for documenting and reporting analysis results to stakeholders of standard and defined process.",
                    "GP_key_obj": "Verify that innovations worked, Measure the improvement, Learn from the innovation cycle",
                    "GP_user_docs_needed": "Improvement evaluation results, Measures against deviations in quantitative process analysis",
                    "GP_rating_rules": {
                            "N": [
                                "The effectiveness of the implemented innovation is not evaluated."
                            ],
                            "P": [
                                "Evaluation is based on subjective opinion rather than measurement.",
                                "Results are not compared to historical data."
                            ],
                            "L": [
                                "The performance of the changed process is measured and evaluated to determine if improvement occurred.",
                                "The analysis may not be statistically rigorous or fully documented."
                            ],
                            "F": [
                                "The effectiveness of the process innovation is evaluated by measuring the performance and capability of the changed process and comparing it with historical data to confirm that common cause variation has been favorably impacted. Results are documented and reported."
                            ]
                        }
                }
            ]
        }
    }
}